<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Function id="_803" name="fgets" returns="_490" context="_1" location="f4:624" file="f4" line="624" extern="1">
    <Argument name="__s" type="_490r" location="f4:624" file="f4" line="624"/>
    <Argument name="__n" type="_45" location="f4:624" file="f4" line="624"/>
    <Argument name="__stream" type="_845r" location="f4:624" file="f4" line="624"/>
  </Function>
  <Typedef id="_804" name="uint_least8_t" type="_562" context="_1" location="f5:77" file="f5" line="77"/>
  <Function id="_805" name="pread64" returns="_537" context="_1" location="f2:402" file="f2" line="402" extern="1">
    <Argument name="__fd" type="_45" location="f2:402" file="f2" line="402"/>
    <Argument name="__buf" type="_668" location="f2:402" file="f2" line="402"/>
    <Argument name="__nbytes" type="_549" location="f2:402" file="f2" line="402"/>
    <Argument name="__offset" type="_671" location="f2:402" file="f2" line="402"/>
  </Function>
  <Function id="_806" name="getresuid" returns="_45" throw="" context="_1" location="f2:753" file="f2" line="753" extern="1">
    <Argument name="__ruid" type="_1565" location="f2:753" file="f2" line="753"/>
    <Argument name="__euid" type="_1565" location="f2:753" file="f2" line="753"/>
    <Argument name="__suid" type="_1565" location="f2:753" file="f2" line="753"/>
  </Function>
  <Typedef id="_807" name="__ino64_t" type="_15" context="_1" location="f9:138" file="f9" line="138"/>
  <Function id="_808" name="__builtin_sinf" returns="_836" context="_1" mangled="sinf" location="f1:76" file="f1" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_836" location="f1:76" file="f1" line="76"/>
  </Function>
  <Function id="_809" name="__builtin_sinh" returns="_834" context="_1" mangled="sinh" location="f1:77" file="f1" line="77" extern="1" attributes="nothrow">
    <Argument type="_834" location="f1:77" file="f1" line="77"/>
  </Function>
  <Typedef id="_810" name="__io_read_fn" type="_428" context="_1" location="f8:364" file="f8" line="364"/>
  <Function id="_811" name="__builtin_sinl" returns="_837" context="_1" mangled="sinl" location="f1:80" file="f1" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_837" location="f1:80" file="f1" line="80"/>
  </Function>
  <Function id="_812" name="fg_frame_release" returns="_80" context="_1" mangled="_Z16fg_frame_releaseP8fg_frame" demangled="fg_frame_release(fg_frame*)" location="f6:1615" file="f6" line="1615" extern="1">
    <Argument name="fr" type="_907" location="f6:1615" file="f6" line="1615"/>
  </Function>
  <Function id="_813" name="lockf64" returns="_45" context="_1" location="f2:1101" file="f2" line="1101" extern="1">
    <Argument name="__fd" type="_45" location="f2:1101" file="f2" line="1101"/>
    <Argument name="__cmd" type="_45" location="f2:1101" file="f2" line="1101"/>
    <Argument name="__len" type="_671" location="f2:1101" file="f2" line="1101"/>
  </Function>
  <Typedef id="_814" name="uint64_t" type="_15" context="_1" location="f5:56" file="f5" line="56"/>
  <Function id="_815" name="__builtin_csin" returns="_905" context="_1" mangled="csin" location="f1:115" file="f1" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_905" location="f1:115" file="f1" line="115"/>
  </Function>
  <Typedef id="_816" name="__clock_t" type="_55" context="_1" location="f9:145" file="f9" line="145"/>
  <Function id="_817" name="getpass" returns="_490" context="_1" location="f2:967" file="f2" line="967" extern="1" attributes="__nonnull__()">
    <Argument name="__prompt" type="_835" location="f2:967" file="f2" line="967"/>
  </Function>
  <Function id="_818" name="fg_get_audio_treble" returns="_45" context="_1" mangled="_Z19fg_get_audio_trebleP10fg_grabber" demangled="fg_get_audio_treble(fg_grabber*)" location="f6:802" file="f6" line="802" extern="1">
    <Argument name="fg" type="_854" location="f6:802" file="f6" line="802"/>
  </Function>
  <Function id="_819" name="_IO_ftrylockfile" returns="_45" throw="" context="_1" location="f8:473" file="f8" line="473" extern="1">
    <Argument type="_877" location="f8:473" file="f8" line="473"/>
  </Function>
  <Function id="_820" name="ftruncate" returns="_45" throw="" context="_1" location="f2:1026" file="f2" line="1026" extern="1">
    <Argument name="__fd" type="_45" location="f2:1026" file="f2" line="1026"/>
    <Argument name="__length" type="_510" location="f2:1026" file="f2" line="1026"/>
  </Function>
  <Typedef id="_821" name="__int32_t" type="_45" context="_1" location="f9:41" file="f9" line="41"/>
  <Typedef id="_822" name="__io_write_fn" type="_220" context="_1" location="f8:373" file="f8" line="373"/>
  <Function id="_823" name="fg_set_background_color" returns="_45" context="_1" mangled="_Z23fg_set_background_colorP10fg_grabberi" demangled="fg_set_background_color(fg_grabber*, int)" location="f6:984" file="f6" line="984" extern="1">
    <Argument name="fg" type="_854" location="f6:984" file="f6" line="984"/>
    <Argument name="value" type="_45" location="f6:984" file="f6" line="984"/>
  </Function>
  <Function id="_824" name="fg_set_auto_brightness" returns="_45" context="_1" mangled="_Z22fg_set_auto_brightnessP10fg_grabberi" demangled="fg_set_auto_brightness(fg_grabber*, int)" location="f6:872" file="f6" line="872" extern="1">
    <Argument name="fg" type="_854" location="f6:872" file="f6" line="872"/>
    <Argument name="value" type="_45" location="f6:872" file="f6" line="872"/>
  </Function>
  <Function id="_825" name="readlinkat" returns="_537" throw="" context="_1" location="f2:841" file="f2" line="841" extern="1" attributes="__nonnull__(,)">
    <Argument name="__fd" type="_45" location="f2:841" file="f2" line="841"/>
    <Argument name="__path" type="_835r" location="f2:841" file="f2" line="841"/>
    <Argument name="__buf" type="_490r" location="f2:841" file="f2" line="841"/>
    <Argument name="__len" type="_549" location="f2:841" file="f2" line="841"/>
  </Function>
  <Typedef id="_826" name="__caddr_t" type="_490" context="_1" location="f9:186" file="f9" line="186"/>
  <Field id="_827" name="type" type="_612" offset="0" context="_3" access="public" location="f0:1632" file="f0" line="1632"/>
  <Field id="_828" name="" type="_829" offset="32" context="_3" access="public" location="f0:1636" file="f0" line="1636"/>
  <Union id="_829" context="_3" access="public" mangled="N14v4l2_dbg_match4._15E" demangled="v4l2_dbg_match::._15" location="f0:1633" file="f0" line="1633" artificial="1" size="256" align="32" members="_1566 _1567 " bases=""/>
  <Destructor id="_830" name="v4l2_dbg_match" artificial="1" throw="" context="_3" access="public" mangled="_ZN14v4l2_dbg_matchD1Ev *INTERNAL* " demangled="v4l2_dbg_match::~v4l2_dbg_match()" location="f0:1631" file="f0" line="1631" endline="1631" inline="1">
  </Destructor>
  <OperatorMethod id="_831" name="=" returns="_1568" artificial="1" throw="" context="_3" access="public" mangled="_ZN14v4l2_dbg_matchaSERKS_" demangled="v4l2_dbg_match::operator=(v4l2_dbg_match const&amp;)" location="f0:1631" file="f0" line="1631" endline="1631" inline="1">
    <Argument type="_1569" location="f0:1631" file="f0" line="1631"/>
  </OperatorMethod>
  <Constructor id="_832" name="v4l2_dbg_match" artificial="1" throw="" context="_3" access="public" mangled="_ZN14v4l2_dbg_matchC1ERKS_ *INTERNAL* " demangled="v4l2_dbg_match::v4l2_dbg_match(v4l2_dbg_match const&amp;)" location="f0:1631" file="f0" line="1631" endline="1631" inline="1">
    <Argument type="_1569" location="f0:1631" file="f0" line="1631"/>
  </Constructor>
  <Constructor id="_833" name="v4l2_dbg_match" artificial="1" throw="" context="_3" access="public" mangled="_ZN14v4l2_dbg_matchC1Ev *INTERNAL* " demangled="v4l2_dbg_match::v4l2_dbg_match()" location="f0:1631" file="f0" line="1631" inline="1"/>
  <FundamentalType id="_834" name="double" size="64" align="64"/>
  <PointerType id="_835" type="_1294c" size="64" align="64"/>
  <FundamentalType id="_836" name="float" size="32" align="32"/>
  <FundamentalType id="_837" name="long double" size="128" align="128"/>
  <Field id="_838" name="tv_sec" type="_497" offset="0" context="_10" access="public" location="f3:77" file="f3" line="77"/>
  <Field id="_839" name="tv_usec" type="_114" offset="64" context="_10" access="public" location="f3:78" file="f3" line="78"/>
  <Destructor id="_840" name="timeval" artificial="1" throw="" context="_10" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f3:76" file="f3" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_841" name="=" returns="_1571" artificial="1" throw="" context="_10" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f3:76" file="f3" line="76" endline="76" inline="1">
    <Argument type="_1572" location="f3:76" file="f3" line="76"/>
  </OperatorMethod>
  <Constructor id="_842" name="timeval" artificial="1" throw="" context="_10" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f3:76" file="f3" line="76" endline="76" inline="1">
    <Argument type="_1572" location="f3:76" file="f3" line="76"/>
  </Constructor>
  <Constructor id="_843" name="timeval" artificial="1" throw="" context="_10" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f3:76" file="f3" line="76" inline="1"/>
  <FundamentalType id="_844" name="bool" size="8" align="8"/>
  <PointerType id="_845" type="_473" size="64" align="64"/>
  <Field id="_846" name="id" type="_612" offset="0" context="_14" access="public" location="f0:951" file="f0" line="951"/>
  <Field id="_847" name="index" type="_612" offset="32" context="_14" access="public" location="f0:952" file="f0" line="952"/>
  <Field id="_848" name="name" type="_1573" offset="64" context="_14" access="public" location="f0:953" file="f0" line="953"/>
  <Field id="_849" name="reserved" type="_612" offset="320" context="_14" access="public" location="f0:954" file="f0" line="954"/>
  <Destructor id="_850" name="v4l2_querymenu" artificial="1" throw="" context="_14" access="public" mangled="_ZN14v4l2_querymenuD1Ev *INTERNAL* " demangled="v4l2_querymenu::~v4l2_querymenu()" location="f0:950" file="f0" line="950" endline="950" inline="1">
  </Destructor>
  <OperatorMethod id="_851" name="=" returns="_1574" artificial="1" throw="" context="_14" access="public" mangled="_ZN14v4l2_querymenuaSERKS_" demangled="v4l2_querymenu::operator=(v4l2_querymenu const&amp;)" location="f0:950" file="f0" line="950" endline="950" inline="1">
    <Argument type="_1575" location="f0:950" file="f0" line="950"/>
  </OperatorMethod>
  <Constructor id="_852" name="v4l2_querymenu" artificial="1" throw="" context="_14" access="public" mangled="_ZN14v4l2_querymenuC1ERKS_ *INTERNAL* " demangled="v4l2_querymenu::v4l2_querymenu(v4l2_querymenu const&amp;)" location="f0:950" file="f0" line="950" endline="950" inline="1">
    <Argument type="_1575" location="f0:950" file="f0" line="950"/>
  </Constructor>
  <Constructor id="_853" name="v4l2_querymenu" artificial="1" throw="" context="_14" access="public" mangled="_ZN14v4l2_querymenuC1Ev *INTERNAL* " demangled="v4l2_querymenu::v4l2_querymenu()" location="f0:950" file="f0" line="950" inline="1"/>
  <PointerType id="_854" type="_243" size="64" align="64"/>
  <CvQualifiedType id="_835r" type="_835" restrict="1"/>
  <PointerType id="_856" type="_1051" size="64" align="64"/>
  <FundamentalType id="_857" name="complex float" size="64" align="32"/>
  <FundamentalType id="_858" name="complex long double" size="256" align="128"/>
  <Field id="_859" name="left" type="_195" offset="0" context="_26" access="public" location="f0:216" file="f0" line="216"/>
  <Field id="_860" name="top" type="_195" offset="32" context="_26" access="public" location="f0:217" file="f0" line="217"/>
  <Field id="_861" name="width" type="_195" offset="64" context="_26" access="public" location="f0:218" file="f0" line="218"/>
  <Field id="_862" name="height" type="_195" offset="96" context="_26" access="public" location="f0:219" file="f0" line="219"/>
  <Destructor id="_863" name="v4l2_rect" artificial="1" throw="" context="_26" access="public" mangled="_ZN9v4l2_rectD1Ev *INTERNAL* " demangled="v4l2_rect::~v4l2_rect()" location="f0:215" file="f0" line="215" endline="215" inline="1">
  </Destructor>
  <OperatorMethod id="_864" name="=" returns="_1576" artificial="1" throw="" context="_26" access="public" mangled="_ZN9v4l2_rectaSERKS_" demangled="v4l2_rect::operator=(v4l2_rect const&amp;)" location="f0:215" file="f0" line="215" endline="215" inline="1">
    <Argument type="_1577" location="f0:215" file="f0" line="215"/>
  </OperatorMethod>
  <Constructor id="_865" name="v4l2_rect" artificial="1" throw="" context="_26" access="public" mangled="_ZN9v4l2_rectC1ERKS_ *INTERNAL* " demangled="v4l2_rect::v4l2_rect(v4l2_rect const&amp;)" location="f0:215" file="f0" line="215" endline="215" inline="1">
    <Argument type="_1577" location="f0:215" file="f0" line="215"/>
  </Constructor>
  <Constructor id="_866" name="v4l2_rect" artificial="1" throw="" context="_26" access="public" mangled="_ZN9v4l2_rectC1Ev *INTERNAL* " demangled="v4l2_rect::v4l2_rect()" location="f0:215" file="f0" line="215" inline="1"/>
  <Field id="_867" name="cmd" type="_612" offset="0" context="_30" access="public" location="f0:1457" file="f0" line="1457"/>
  <Field id="_868" name="flags" type="_612" offset="32" context="_30" access="public" location="f0:1458" file="f0" line="1458"/>
  <Field id="_869" name="" type="_870" offset="64" context="_30" access="public" location="f0:1463" file="f0" line="1463"/>
  <Union id="_870" context="_30" access="public" mangled="N16v4l2_encoder_cmd4._10E" demangled="v4l2_encoder_cmd::._10" location="f0:1459" file="f0" line="1459" artificial="1" size="256" align="32" members="_1578 _1579 " bases=""/>
  <Destructor id="_871" name="v4l2_encoder_cmd" artificial="1" throw="" context="_30" access="public" mangled="_ZN16v4l2_encoder_cmdD1Ev *INTERNAL* " demangled="v4l2_encoder_cmd::~v4l2_encoder_cmd()" location="f0:1456" file="f0" line="1456" endline="1456" inline="1">
  </Destructor>
  <OperatorMethod id="_872" name="=" returns="_1580" artificial="1" throw="" context="_30" access="public" mangled="_ZN16v4l2_encoder_cmdaSERKS_" demangled="v4l2_encoder_cmd::operator=(v4l2_encoder_cmd const&amp;)" location="f0:1456" file="f0" line="1456" endline="1456" inline="1">
    <Argument type="_1581" location="f0:1456" file="f0" line="1456"/>
  </OperatorMethod>
  <Constructor id="_873" name="v4l2_encoder_cmd" artificial="1" throw="" context="_30" access="public" mangled="_ZN16v4l2_encoder_cmdC1ERKS_ *INTERNAL* " demangled="v4l2_encoder_cmd::v4l2_encoder_cmd(v4l2_encoder_cmd const&amp;)" location="f0:1456" file="f0" line="1456" endline="1456" inline="1">
    <Argument type="_1581" location="f0:1456" file="f0" line="1456"/>
  </Constructor>
  <Constructor id="_874" name="v4l2_encoder_cmd" artificial="1" throw="" context="_30" access="public" mangled="_ZN16v4l2_encoder_cmdC1Ev *INTERNAL* " demangled="v4l2_encoder_cmd::v4l2_encoder_cmd()" location="f0:1456" file="f0" line="1456" inline="1"/>
  <CvQualifiedType id="_668r" type="_668" restrict="1"/>
  <PointerType id="_876" type="_490c" size="64" align="64"/>
  <PointerType id="_877" type="_117" size="64" align="64"/>
  <CvQualifiedType id="_490r" type="_490" restrict="1"/>
  <Field id="_879" name="read" type="_1583" offset="0" context="_54" access="public" location="f8:397" file="f8" line="397"/>
  <Field id="_880" name="write" type="_1584" offset="64" context="_54" access="public" location="f8:398" file="f8" line="398"/>
  <Field id="_881" name="seek" type="_1585" offset="128" context="_54" access="public" location="f8:399" file="f8" line="399"/>
  <Field id="_882" name="close" type="_1586" offset="192" context="_54" access="public" location="f8:400" file="f8" line="400"/>
  <Destructor id="_883" name="._20" artificial="1" throw="" context="_54" access="public" mangled="_ZN25_IO_cookie_io_functions_tD1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::~_IO_cookie_io_functions_t()" location="f8:401" file="f8" line="401" endline="401" inline="1">
  </Destructor>
  <OperatorMethod id="_884" name="=" returns="_1587" artificial="1" throw="" context="_54" access="public" mangled="_ZN25_IO_cookie_io_functions_taSERKS_" demangled="_IO_cookie_io_functions_t::operator=(_IO_cookie_io_functions_t const&amp;)" location="f8:401" file="f8" line="401" endline="401" inline="1">
    <Argument type="_1588" location="f8:396" file="f8" line="396"/>
  </OperatorMethod>
  <Constructor id="_885" name="._20" artificial="1" throw="" context="_54" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1ERKS_ *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t(_IO_cookie_io_functions_t const&amp;)" location="f8:401" file="f8" line="401" endline="401" inline="1">
    <Argument type="_1588" location="f8:396" file="f8" line="396"/>
  </Constructor>
  <Constructor id="_886" name="._20" artificial="1" throw="" context="_54" access="public" mangled="_ZN25_IO_cookie_io_functions_tC1Ev *INTERNAL* " demangled="_IO_cookie_io_functions_t::_IO_cookie_io_functions_t()" location="f8:401" file="f8" line="401" inline="1"/>
  <PointerType id="_887" type="_53" size="64" align="64"/>
  <CvQualifiedType id="_887r" type="_887" restrict="1"/>
  <CvQualifiedType id="_845r" type="_845" restrict="1"/>
  <Field id="_890" name="__val" type="_1589" offset="0" context="_68" access="public" location="f10:31" file="f10" line="31"/>
  <Destructor id="_891" name="._1" artificial="1" throw="" context="_68" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f10:32" file="f10" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_892" name="=" returns="_1590" artificial="1" throw="" context="_68" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f10:32" file="f10" line="32" endline="32" inline="1">
    <Argument type="_1591" location="f10:30" file="f10" line="30"/>
  </OperatorMethod>
  <Constructor id="_893" name="._1" artificial="1" throw="" context="_68" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f10:32" file="f10" line="32" endline="32" inline="1">
    <Argument type="_1591" location="f10:30" file="f10" line="30"/>
  </Constructor>
  <Constructor id="_894" name="._1" artificial="1" throw="" context="_68" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f10:32" file="f10" line="32" inline="1"/>
  <Field id="_895" name="service_set" type="_609" offset="0" context="_74" access="public" location="f0:1523" file="f0" line="1523"/>
  <Field id="_896" name="service_lines" type="_1592" offset="16" context="_74" access="public" location="f0:1528" file="f0" line="1528"/>
  <Field id="_897" name="type" type="_592" offset="800" context="_74" access="public" location="f0:1529" file="f0" line="1529"/>
  <Field id="_898" name="reserved" type="_1593" offset="832" context="_74" access="public" location="f0:1530" file="f0" line="1530"/>
  <Destructor id="_899" name="v4l2_sliced_vbi_cap" artificial="1" throw="" context="_74" access="public" mangled="_ZN19v4l2_sliced_vbi_capD1Ev *INTERNAL* " demangled="v4l2_sliced_vbi_cap::~v4l2_sliced_vbi_cap()" location="f0:1522" file="f0" line="1522" endline="1522" inline="1">
  </Destructor>
  <OperatorMethod id="_900" name="=" returns="_1594" artificial="1" throw="" context="_74" access="public" mangled="_ZN19v4l2_sliced_vbi_capaSERKS_" demangled="v4l2_sliced_vbi_cap::operator=(v4l2_sliced_vbi_cap const&amp;)" location="f0:1522" file="f0" line="1522" endline="1522" inline="1">
    <Argument type="_1595" location="f0:1522" file="f0" line="1522"/>
  </OperatorMethod>
  <Constructor id="_901" name="v4l2_sliced_vbi_cap" artificial="1" throw="" context="_74" access="public" mangled="_ZN19v4l2_sliced_vbi_capC1ERKS_ *INTERNAL* " demangled="v4l2_sliced_vbi_cap::v4l2_sliced_vbi_cap(v4l2_sliced_vbi_cap const&amp;)" location="f0:1522" file="f0" line="1522" endline="1522" inline="1">
    <Argument type="_1595" location="f0:1522" file="f0" line="1522"/>
  </Constructor>
  <Constructor id="_902" name="v4l2_sliced_vbi_cap" artificial="1" throw="" context="_74" access="public" mangled="_ZN19v4l2_sliced_vbi_capC1Ev *INTERNAL* " demangled="v4l2_sliced_vbi_cap::v4l2_sliced_vbi_cap()" location="f0:1522" file="f0" line="1522" inline="1"/>
  <PointerType id="_903" type="_490" size="64" align="64"/>
  <CvQualifiedType id="_903r" type="_903" restrict="1"/>
  <FundamentalType id="_905" name="complex double" size="128" align="64"/>
  <PointerType id="_906" type="_618" size="64" align="64"/>
  <PointerType id="_907" type="_154" size="64" align="64"/>
  <Field id="_908" name="index" type="_612" offset="0" context="_110" access="public" location="f0:436" file="f0" line="436"/>
  <Field id="_909" name="pixel_format" type="_612" offset="32" context="_110" access="public" location="f0:437" file="f0" line="437"/>
  <Field id="_910" name="width" type="_612" offset="64" context="_110" access="public" location="f0:438" file="f0" line="438"/>
  <Field id="_911" name="height" type="_612" offset="96" context="_110" access="public" location="f0:439" file="f0" line="439"/>
  <Field id="_912" name="type" type="_612" offset="128" context="_110" access="public" location="f0:440" file="f0" line="440"/>
  <Field id="_913" name="" type="_915" offset="160" context="_110" access="public" location="f0:445" file="f0" line="445"/>
  <Field id="_914" name="reserved" type="_1596" offset="352" context="_110" access="public" location="f0:447" file="f0" line="447"/>
  <Union id="_915" context="_110" access="public" mangled="N16v4l2_frmivalenum3._6E" demangled="v4l2_frmivalenum::._6" location="f0:442" file="f0" line="442" artificial="1" size="192" align="32" members="_1597 _1598 " bases=""/>
  <Destructor id="_916" name="v4l2_frmivalenum" artificial="1" throw="" context="_110" access="public" mangled="_ZN16v4l2_frmivalenumD1Ev *INTERNAL* " demangled="v4l2_frmivalenum::~v4l2_frmivalenum()" location="f0:435" file="f0" line="435" endline="435" inline="1">
  </Destructor>
  <OperatorMethod id="_917" name="=" returns="_1599" artificial="1" throw="" context="_110" access="public" mangled="_ZN16v4l2_frmivalenumaSERKS_" demangled="v4l2_frmivalenum::operator=(v4l2_frmivalenum const&amp;)" location="f0:435" file="f0" line="435" endline="435" inline="1">
    <Argument type="_1600" location="f0:435" file="f0" line="435"/>
  </OperatorMethod>
  <Constructor id="_918" name="v4l2_frmivalenum" artificial="1" throw="" context="_110" access="public" mangled="_ZN16v4l2_frmivalenumC1ERKS_ *INTERNAL* " demangled="v4l2_frmivalenum::v4l2_frmivalenum(v4l2_frmivalenum const&amp;)" location="f0:435" file="f0" line="435" endline="435" inline="1">
    <Argument type="_1600" location="f0:435" file="f0" line="435"/>
  </Constructor>
  <Constructor id="_919" name="v4l2_frmivalenum" artificial="1" throw="" context="_110" access="public" mangled="_ZN16v4l2_frmivalenumC1Ev *INTERNAL* " demangled="v4l2_frmivalenum::v4l2_frmivalenum()" location="f0:435" file="f0" line="435" inline="1"/>
  <PointerType id="_920" type="_549" size="64" align="64"/>
  <CvQualifiedType id="_920r" type="_920" restrict="1"/>
  <Field id="_922" name="_flags" type="_45" offset="0" context="_117" access="public" location="f8:272" file="f8" line="272"/>
  <Field id="_923" name="_IO_read_ptr" type="_490" offset="64" context="_117" access="public" location="f8:277" file="f8" line="277"/>
  <Field id="_924" name="_IO_read_end" type="_490" offset="128" context="_117" access="public" location="f8:278" file="f8" line="278"/>
  <Field id="_925" name="_IO_read_base" type="_490" offset="192" context="_117" access="public" location="f8:279" file="f8" line="279"/>
  <Field id="_926" name="_IO_write_base" type="_490" offset="256" context="_117" access="public" location="f8:280" file="f8" line="280"/>
  <Field id="_927" name="_IO_write_ptr" type="_490" offset="320" context="_117" access="public" location="f8:281" file="f8" line="281"/>
  <Field id="_928" name="_IO_write_end" type="_490" offset="384" context="_117" access="public" location="f8:282" file="f8" line="282"/>
  <Field id="_929" name="_IO_buf_base" type="_490" offset="448" context="_117" access="public" location="f8:283" file="f8" line="283"/>
  <Field id="_930" name="_IO_buf_end" type="_490" offset="512" context="_117" access="public" location="f8:284" file="f8" line="284"/>
  <Field id="_931" name="_IO_save_base" type="_490" offset="576" context="_117" access="public" location="f8:286" file="f8" line="286"/>
  <Field id="_932" name="_IO_backup_base" type="_490" offset="640" context="_117" access="public" location="f8:287" file="f8" line="287"/>
  <Field id="_933" name="_IO_save_end" type="_490" offset="704" context="_117" access="public" location="f8:288" file="f8" line="288"/>
  <Field id="_934" name="_markers" type="_1601" offset="768" context="_117" access="public" location="f8:290" file="f8" line="290"/>
  <Field id="_935" name="_chain" type="_877" offset="832" context="_117" access="public" location="f8:292" file="f8" line="292"/>
  <Field id="_936" name="_fileno" type="_45" offset="896" context="_117" access="public" location="f8:294" file="f8" line="294"/>
  <Field id="_937" name="_flags2" type="_45" offset="928" context="_117" access="public" location="f8:298" file="f8" line="298"/>
  <Field id="_938" name="_old_offset" type="_510" offset="960" context="_117" access="public" location="f8:300" file="f8" line="300"/>
  <Field id="_939" name="_cur_column" type="_196" offset="1024" context="_117" access="public" location="f8:304" file="f8" line="304"/>
  <Field id="_940" name="_vtable_offset" type="_178" offset="1040" context="_117" access="public" location="f8:305" file="f8" line="305"/>
  <Field id="_941" name="_shortbuf" type="_1602" offset="1048" context="_117" access="public" location="f8:306" file="f8" line="306"/>
  <Field id="_942" name="_lock" type="_1603" offset="1088" context="_117" access="public" location="f8:310" file="f8" line="310"/>
  <Field id="_943" name="_offset" type="_671" offset="1152" context="_117" access="public" location="f8:319" file="f8" line="319"/>
  <Field id="_944" name="__pad1" type="_668" offset="1216" context="_117" access="public" location="f8:328" file="f8" line="328"/>
  <Field id="_945" name="__pad2" type="_668" offset="1280" context="_117" access="public" location="f8:329" file="f8" line="329"/>
  <Field id="_946" name="__pad3" type="_668" offset="1344" context="_117" access="public" location="f8:330" file="f8" line="330"/>
  <Field id="_947" name="__pad4" type="_668" offset="1408" context="_117" access="public" location="f8:331" file="f8" line="331"/>
  <Field id="_948" name="__pad5" type="_549" offset="1472" context="_117" access="public" location="f8:332" file="f8" line="332"/>
  <Field id="_949" name="_mode" type="_45" offset="1536" context="_117" access="public" location="f8:334" file="f8" line="334"/>
  <Field id="_950" name="_unused2" type="_1604" offset="1568" context="_117" access="public" location="f8:336" file="f8" line="336"/>
  <Destructor id="_951" name="_IO_FILE" artificial="1" throw="" context="_117" access="public" mangled="_ZN8_IO_FILED1Ev *INTERNAL* " demangled="_IO_FILE::~_IO_FILE()" location="f8:271" file="f8" line="271" endline="271" inline="1">
  </Destructor>
  <OperatorMethod id="_952" name="=" returns="_1605" artificial="1" throw="" context="_117" access="public" mangled="_ZN8_IO_FILEaSERKS_" demangled="_IO_FILE::operator=(_IO_FILE const&amp;)" location="f8:271" file="f8" line="271" endline="271" inline="1">
    <Argument type="_1606" location="f8:271" file="f8" line="271"/>
  </OperatorMethod>
  <Constructor id="_953" name="_IO_FILE" artificial="1" throw="" context="_117" access="public" mangled="_ZN8_IO_FILEC1ERKS_ *INTERNAL* " demangled="_IO_FILE::_IO_FILE(_IO_FILE const&amp;)" location="f8:271" file="f8" line="271" endline="271" inline="1">
    <Argument type="_1606" location="f8:271" file="f8" line="271"/>
  </Constructor>
  <Constructor id="_954" name="_IO_FILE" artificial="1" throw="" context="_117" access="public" mangled="_ZN8_IO_FILEC1Ev *INTERNAL* " demangled="_IO_FILE::_IO_FILE()" location="f8:271" file="f8" line="271" inline="1"/>
  <Field id="_956" name="size" type="_336" offset="0" context="_154" access="public" location="f6:164" file="f6" line="164"/>
  <Field id="_957" name="rowstride" type="_45" offset="64" context="_154" access="public" location="f6:165" file="f6" line="165"/>
  <Field id="_958" name="format" type="_45" offset="96" context="_154" access="public" location="f6:166" file="f6" line="166"/>
  <Field id="_959" name="length" type="_45" offset="128" context="_154" access="public" location="f6:167" file="f6" line="167"/>
  <Field id="_960" name="data" type="_977" offset="192" context="_154" access="public" location="f6:168" file="f6" line="168"/>
  <Field id="_961" name="timestamp" type="_10" offset="256" context="_154" access="public" location="f6:169" file="f6" line="169"/>
  <Destructor id="_962" name="._27" artificial="1" throw="" context="_154" access="public" mangled="_ZN8fg_frameD1Ev *INTERNAL* " demangled="fg_frame::~fg_frame()" location="f6:171" file="f6" line="171" endline="171" inline="1">
  </Destructor>
  <OperatorMethod id="_963" name="=" returns="_1607" artificial="1" throw="" context="_154" access="public" mangled="_ZN8fg_frameaSERKS_" demangled="fg_frame::operator=(fg_frame const&amp;)" location="f6:171" file="f6" line="171" endline="171" inline="1">
    <Argument type="_1608" location="f6:163" file="f6" line="163"/>
  </OperatorMethod>
  <Constructor id="_964" name="._27" artificial="1" throw="" context="_154" access="public" mangled="_ZN8fg_frameC1ERKS_ *INTERNAL* " demangled="fg_frame::fg_frame(fg_frame const&amp;)" location="f6:171" file="f6" line="171" endline="171" inline="1">
    <Argument type="_1608" location="f6:163" file="f6" line="163"/>
  </Constructor>
  <Constructor id="_965" name="._27" artificial="1" throw="" context="_154" access="public" mangled="_ZN8fg_frameC1Ev *INTERNAL* " demangled="fg_frame::fg_frame()" location="f6:171" file="f6" line="171" inline="1"/>
  <Field id="_966" name="tuner" type="_612" offset="0" context="_155" access="public" location="f0:1359" file="f0" line="1359"/>
  <Field id="_967" name="type" type="_188" offset="32" context="_155" access="public" location="f0:1360" file="f0" line="1360"/>
  <Field id="_968" name="frequency" type="_612" offset="64" context="_155" access="public" location="f0:1361" file="f0" line="1361"/>
  <Field id="_969" name="reserved" type="_1609" offset="96" context="_155" access="public" location="f0:1362" file="f0" line="1362"/>
  <Destructor id="_970" name="v4l2_frequency" artificial="1" throw="" context="_155" access="public" mangled="_ZN14v4l2_frequencyD1Ev *INTERNAL* " demangled="v4l2_frequency::~v4l2_frequency()" location="f0:1358" file="f0" line="1358" endline="1358" inline="1">
  </Destructor>
  <OperatorMethod id="_971" name="=" returns="_1610" artificial="1" throw="" context="_155" access="public" mangled="_ZN14v4l2_frequencyaSERKS_" demangled="v4l2_frequency::operator=(v4l2_frequency const&amp;)" location="f0:1358" file="f0" line="1358" endline="1358" inline="1">
    <Argument type="_1611" location="f0:1358" file="f0" line="1358"/>
  </OperatorMethod>
  <Constructor id="_972" name="v4l2_frequency" artificial="1" throw="" context="_155" access="public" mangled="_ZN14v4l2_frequencyC1ERKS_ *INTERNAL* " demangled="v4l2_frequency::v4l2_frequency(v4l2_frequency const&amp;)" location="f0:1358" file="f0" line="1358" endline="1358" inline="1">
    <Argument type="_1611" location="f0:1358" file="f0" line="1358"/>
  </Constructor>
  <Constructor id="_973" name="v4l2_frequency" artificial="1" throw="" context="_155" access="public" mangled="_ZN14v4l2_frequencyC1Ev *INTERNAL* " demangled="v4l2_frequency::v4l2_frequency()" location="f0:1358" file="f0" line="1358" inline="1"/>
  <PointerType id="_974" type="_583" size="64" align="64"/>
  <PointerType id="_975" type="_312" size="64" align="64"/>
  <CvQualifiedType id="_975r" type="_975" restrict="1"/>
  <PointerType id="_977" type="_562" size="64" align="64"/>
  <PointerType id="_978" type="_618c" size="64" align="64"/>
  <CvQualifiedType id="_978r" type="_978" restrict="1"/>
  <CvQualifiedType id="_906r" type="_906" restrict="1"/>
  <PointerType id="_981" type="_10c" size="64" align="64"/>
  <PointerType id="_982" type="_336" size="64" align="64"/>
  <Field id="_983" name="fds_bits" type="_1614" offset="0" context="_198" access="public" location="f11:72" file="f11" line="72"/>
  <Destructor id="_984" name="._2" artificial="1" throw="" context="_198" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f11:78" file="f11" line="78" endline="78" inline="1">
  </Destructor>
  <OperatorMethod id="_985" name="=" returns="_1615" artificial="1" throw="" context="_198" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f11:78" file="f11" line="78" endline="78" inline="1">
    <Argument type="_1616" location="f11:68" file="f11" line="68"/>
  </OperatorMethod>
  <Constructor id="_986" name="._2" artificial="1" throw="" context="_198" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f11:78" file="f11" line="78" endline="78" inline="1">
    <Argument type="_1616" location="f11:68" file="f11" line="68"/>
  </Constructor>
  <Constructor id="_987" name="._2" artificial="1" throw="" context="_198" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f11:78" file="f11" line="78" inline="1"/>
  <PointerType id="_988" type="_80c" size="64" align="64"/>
  <CvQualifiedType id="_988r" type="_988" restrict="1"/>
  <Field id="_990" name="match" type="_3" offset="0" context="_228" access="public" location="f0:1640" file="f0" line="1640"/>
  <Field id="_991" name="size" type="_612" offset="288" context="_228" access="public" location="f0:1641" file="f0" line="1641"/>
  <Field id="_992" name="reg" type="_624" offset="320" context="_228" access="public" location="f0:1642" file="f0" line="1642"/>
  <Field id="_993" name="val" type="_624" offset="384" context="_228" access="public" location="f0:1643" file="f0" line="1643"/>
  <Destructor id="_994" name="v4l2_dbg_register" artificial="1" throw="" context="_228" access="public" mangled="_ZN17v4l2_dbg_registerD1Ev *INTERNAL* " demangled="v4l2_dbg_register::~v4l2_dbg_register()" location="f0:1639" file="f0" line="1639" endline="1639" inline="1">
  </Destructor>
  <OperatorMethod id="_995" name="=" returns="_1618" artificial="1" throw="" context="_228" access="public" mangled="_ZN17v4l2_dbg_registeraSERKS_" demangled="v4l2_dbg_register::operator=(v4l2_dbg_register const&amp;)" location="f0:1639" file="f0" line="1639" endline="1639" inline="1">
    <Argument type="_1619" location="f0:1639" file="f0" line="1639"/>
  </OperatorMethod>
  <Constructor id="_996" name="v4l2_dbg_register" artificial="1" throw="" context="_228" access="public" mangled="_ZN17v4l2_dbg_registerC1ERKS_ *INTERNAL* " demangled="v4l2_dbg_register::v4l2_dbg_register(v4l2_dbg_register const&amp;)" location="f0:1639" file="f0" line="1639" endline="1639" inline="1">
    <Argument type="_1619" location="f0:1639" file="f0" line="1639"/>
  </Constructor>
  <Constructor id="_997" name="v4l2_dbg_register" artificial="1" throw="" context="_228" access="public" mangled="_ZN17v4l2_dbg_registerC1Ev *INTERNAL* " demangled="v4l2_dbg_register::v4l2_dbg_register()" location="f0:1639" file="f0" line="1639" inline="1"/>
  <Field id="_998" name="type" type="_592" offset="0" context="_240" access="public" location="f0:622" file="f0" line="622"/>
  <Field id="_999" name="bounds" type="_26" offset="32" context="_240" access="public" location="f0:623" file="f0" line="623"/>
  <Field id="_1000" name="defrect" type="_26" offset="160" context="_240" access="public" location="f0:624" file="f0" line="624"/>
  <Field id="_1001" name="pixelaspect" type="_794" offset="288" context="_240" access="public" location="f0:625" file="f0" line="625"/>
  <Destructor id="_1002" name="v4l2_cropcap" artificial="1" throw="" context="_240" access="public" mangled="_ZN12v4l2_cropcapD1Ev *INTERNAL* " demangled="v4l2_cropcap::~v4l2_cropcap()" location="f0:621" file="f0" line="621" endline="621" inline="1">
  </Destructor>
  <OperatorMethod id="_1003" name="=" returns="_1620" artificial="1" throw="" context="_240" access="public" mangled="_ZN12v4l2_cropcapaSERKS_" demangled="v4l2_cropcap::operator=(v4l2_cropcap const&amp;)" location="f0:621" file="f0" line="621" endline="621" inline="1">
    <Argument type="_1621" location="f0:621" file="f0" line="621"/>
  </OperatorMethod>
  <Constructor id="_1004" name="v4l2_cropcap" artificial="1" throw="" context="_240" access="public" mangled="_ZN12v4l2_cropcapC1ERKS_ *INTERNAL* " demangled="v4l2_cropcap::v4l2_cropcap(v4l2_cropcap const&amp;)" location="f0:621" file="f0" line="621" endline="621" inline="1">
    <Argument type="_1621" location="f0:621" file="f0" line="621"/>
  </Constructor>
  <Constructor id="_1005" name="v4l2_cropcap" artificial="1" throw="" context="_240" access="public" mangled="_ZN12v4l2_cropcapC1Ev *INTERNAL* " demangled="v4l2_cropcap::v4l2_cropcap()" location="f0:621" file="f0" line="621" inline="1"/>
  <Field id="_1006" name="device" type="_490" offset="0" context="_243" access="public" location="f6:178" file="f6" line="178"/>
  <Field id="_1007" name="fd" type="_45" offset="64" context="_243" access="public" location="f6:179" file="f6" line="179"/>
  <Field id="_1008" name="caps" type="_317" offset="96" context="_243" access="public" location="f6:180" file="f6" line="180"/>
  <Field id="_1009" name="inputs" type="_1622" offset="960" context="_243" access="public" location="f6:181" file="f6" line="181"/>
  <Field id="_1010" name="num_inputs" type="_45" offset="1024" context="_243" access="public" location="f6:182" file="f6" line="182"/>
  <Field id="_1011" name="input" type="_45" offset="1056" context="_243" access="public" location="f6:183" file="f6" line="183"/>
  <Field id="_1012" name="tuners" type="_1623" offset="1088" context="_243" access="public" location="f6:184" file="f6" line="184"/>
  <Field id="_1013" name="num_tuners" type="_45" offset="1152" context="_243" access="public" location="f6:185" file="f6" line="185"/>
  <Field id="_1014" name="tuner" type="_45" offset="1184" context="_243" access="public" location="f6:186" file="f6" line="186"/>
  <Field id="_1015" name="cropcap" type="_241" offset="1216" context="_243" access="public" location="f6:187" file="f6" line="187"/>
  <Field id="_1016" name="format" type="_730" offset="1600" context="_243" access="public" location="f6:188" file="f6" line="188"/>
  <Field id="_1017" name="controls" type="_1624" offset="3264" context="_243" access="public" location="f6:189" file="f6" line="189"/>
  <Field id="_1018" name="num_controls" type="_45" offset="3328" context="_243" access="public" location="f6:190" file="f6" line="190"/>
  <Destructor id="_1019" name="._28" artificial="1" throw="" context="_243" access="public" mangled="_ZN10fg_grabberD1Ev *INTERNAL* " demangled="fg_grabber::~fg_grabber()" location="f6:192" file="f6" line="192" endline="192" inline="1">
  </Destructor>
  <OperatorMethod id="_1020" name="=" returns="_1625" artificial="1" throw="" context="_243" access="public" mangled="_ZN10fg_grabberaSERKS_" demangled="fg_grabber::operator=(fg_grabber const&amp;)" location="f6:192" file="f6" line="192" endline="192" inline="1">
    <Argument type="_1626" location="f6:177" file="f6" line="177"/>
  </OperatorMethod>
  <Constructor id="_1021" name="._28" artificial="1" throw="" context="_243" access="public" mangled="_ZN10fg_grabberC1ERKS_ *INTERNAL* " demangled="fg_grabber::fg_grabber(fg_grabber const&amp;)" location="f6:192" file="f6" line="192" endline="192" inline="1">
    <Argument type="_1626" location="f6:177" file="f6" line="177"/>
  </Constructor>
  <Constructor id="_1022" name="._28" artificial="1" throw="" context="_243" access="public" mangled="_ZN10fg_grabberC1Ev *INTERNAL* " demangled="fg_grabber::fg_grabber()" location="f6:192" file="f6" line="192" inline="1"/>
  <Field id="_1023" name="id" type="_612" offset="0" context="_244" access="public" location="f0:903" file="f0" line="903"/>
  <Field id="_1024" name="value" type="_195" offset="32" context="_244" access="public" location="f0:904" file="f0" line="904"/>
  <Destructor id="_1025" name="v4l2_control" artificial="1" throw="" context="_244" access="public" mangled="_ZN12v4l2_controlD1Ev *INTERNAL* " demangled="v4l2_control::~v4l2_control()" location="f0:902" file="f0" line="902" endline="902" inline="1">
  </Destructor>
  <OperatorMethod id="_1026" name="=" returns="_1627" artificial="1" throw="" context="_244" access="public" mangled="_ZN12v4l2_controlaSERKS_" demangled="v4l2_control::operator=(v4l2_control const&amp;)" location="f0:902" file="f0" line="902" endline="902" inline="1">
    <Argument type="_1628" location="f0:902" file="f0" line="902"/>
  </OperatorMethod>
  <Constructor id="_1027" name="v4l2_control" artificial="1" throw="" context="_244" access="public" mangled="_ZN12v4l2_controlC1ERKS_ *INTERNAL* " demangled="v4l2_control::v4l2_control(v4l2_control const&amp;)" location="f0:902" file="f0" line="902" endline="902" inline="1">
    <Argument type="_1628" location="f0:902" file="f0" line="902"/>
  </Constructor>
  <Constructor id="_1028" name="v4l2_control" artificial="1" throw="" context="_244" access="public" mangled="_ZN12v4l2_controlC1Ev *INTERNAL* " demangled="v4l2_control::v4l2_control()" location="f0:902" file="f0" line="902" inline="1"/>
  <Field id="_1029" name="index" type="_612" offset="0" context="_245" access="public" location="f0:1398" file="f0" line="1398"/>
  <Field id="_1030" name="name" type="_1573" offset="32" context="_245" access="public" location="f0:1399" file="f0" line="1399"/>
  <Field id="_1031" name="capability" type="_612" offset="288" context="_245" access="public" location="f0:1400" file="f0" line="1400"/>
  <Field id="_1032" name="mode" type="_612" offset="320" context="_245" access="public" location="f0:1401" file="f0" line="1401"/>
  <Field id="_1033" name="reserved" type="_1596" offset="352" context="_245" access="public" location="f0:1402" file="f0" line="1402"/>
  <Destructor id="_1034" name="v4l2_audio" artificial="1" throw="" context="_245" access="public" mangled="_ZN10v4l2_audioD1Ev *INTERNAL* " demangled="v4l2_audio::~v4l2_audio()" location="f0:1397" file="f0" line="1397" endline="1397" inline="1">
  </Destructor>
  <OperatorMethod id="_1035" name="=" returns="_1629" artificial="1" throw="" context="_245" access="public" mangled="_ZN10v4l2_audioaSERKS_" demangled="v4l2_audio::operator=(v4l2_audio const&amp;)" location="f0:1397" file="f0" line="1397" endline="1397" inline="1">
    <Argument type="_1630" location="f0:1397" file="f0" line="1397"/>
  </OperatorMethod>
  <Constructor id="_1036" name="v4l2_audio" artificial="1" throw="" context="_245" access="public" mangled="_ZN10v4l2_audioC1ERKS_ *INTERNAL* " demangled="v4l2_audio::v4l2_audio(v4l2_audio const&amp;)" location="f0:1397" file="f0" line="1397" endline="1397" inline="1">
    <Argument type="_1630" location="f0:1397" file="f0" line="1397"/>
  </Constructor>
  <Constructor id="_1037" name="v4l2_audio" artificial="1" throw="" context="_245" access="public" mangled="_ZN10v4l2_audioC1Ev *INTERNAL* " demangled="v4l2_audio::v4l2_audio()" location="f0:1397" file="f0" line="1397" inline="1"/>
  <Field id="_1038" name="__pos" type="_510" offset="0" context="_249" access="public" location="f15:24" file="f15" line="24"/>
  <Field id="_1039" name="__state" type="_389" offset="64" context="_249" access="public" location="f15:25" file="f15" line="25"/>
  <Destructor id="_1040" name="._18" artificial="1" throw="" context="_249" access="public" mangled="_ZN9_G_fpos_tD1Ev *INTERNAL* " demangled="_G_fpos_t::~_G_fpos_t()" location="f15:26" file="f15" line="26" endline="26" inline="1">
  </Destructor>
  <OperatorMethod id="_1041" name="=" returns="_1631" artificial="1" throw="" context="_249" access="public" mangled="_ZN9_G_fpos_taSERKS_" demangled="_G_fpos_t::operator=(_G_fpos_t const&amp;)" location="f15:26" file="f15" line="26" endline="26" inline="1">
    <Argument type="_1632" location="f15:23" file="f15" line="23"/>
  </OperatorMethod>
  <Constructor id="_1042" name="._18" artificial="1" throw="" context="_249" access="public" mangled="_ZN9_G_fpos_tC1ERKS_ *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t(_G_fpos_t const&amp;)" location="f15:26" file="f15" line="26" endline="26" inline="1">
    <Argument type="_1632" location="f15:23" file="f15" line="23"/>
  </Constructor>
  <Constructor id="_1043" name="._18" artificial="1" throw="" context="_249" access="public" mangled="_ZN9_G_fpos_tC1Ev *INTERNAL* " demangled="_G_fpos_t::_G_fpos_t()" location="f15:26" file="f15" line="26" inline="1"/>
  <Field id="_1044" name="c" type="_26" offset="0" context="_252" access="public" location="f0:579" file="f0" line="579"/>
  <Field id="_1045" name="next" type="_1633" offset="128" context="_252" access="public" location="f0:580" file="f0" line="580"/>
  <Destructor id="_1046" name="v4l2_clip" artificial="1" throw="" context="_252" access="public" mangled="_ZN9v4l2_clipD1Ev *INTERNAL* " demangled="v4l2_clip::~v4l2_clip()" location="f0:578" file="f0" line="578" endline="578" inline="1">
  </Destructor>
  <OperatorMethod id="_1047" name="=" returns="_1634" artificial="1" throw="" context="_252" access="public" mangled="_ZN9v4l2_clipaSERKS_" demangled="v4l2_clip::operator=(v4l2_clip const&amp;)" location="f0:578" file="f0" line="578" endline="578" inline="1">
    <Argument type="_1635" location="f0:578" file="f0" line="578"/>
  </OperatorMethod>
  <Constructor id="_1048" name="v4l2_clip" artificial="1" throw="" context="_252" access="public" mangled="_ZN9v4l2_clipC1ERKS_ *INTERNAL* " demangled="v4l2_clip::v4l2_clip(v4l2_clip const&amp;)" location="f0:578" file="f0" line="578" endline="578" inline="1">
    <Argument type="_1635" location="f0:578" file="f0" line="578"/>
  </Constructor>
  <Constructor id="_1049" name="v4l2_clip" artificial="1" throw="" context="_252" access="public" mangled="_ZN9v4l2_clipC1Ev *INTERNAL* " demangled="v4l2_clip::v4l2_clip()" location="f0:578" file="f0" line="578" inline="1"/>
  <PointerType id="_1050" type="_196" size="64" align="64"/>
  <Struct id="_1051" name="__va_list_tag" context="_1" mangled="13__va_list_tag" demangled="__va_list_tag" location="f26:0" file="f26" line="0" size="192" align="64" members=""/>
  <ArrayType id="_1052" min="0" max="" type="_835" align="64"/>
  <CvQualifiedType id="_1052c" type="_1052" const="1"/>
  <PointerType id="_1054" type="_45" size="64" align="64"/>
  <PointerType id="_1055" type="_10" size="64" align="64"/>
  <Field id="_1056" name="width" type="_612" offset="0" context="_282" access="public" location="f0:265" file="f0" line="265"/>
  <Field id="_1057" name="height" type="_612" offset="32" context="_282" access="public" location="f0:266" file="f0" line="266"/>
  <Field id="_1058" name="pixelformat" type="_612" offset="64" context="_282" access="public" location="f0:267" file="f0" line="267"/>
  <Field id="_1059" name="field" type="_727" offset="96" context="_282" access="public" location="f0:268" file="f0" line="268"/>
  <Field id="_1060" name="bytesperline" type="_612" offset="128" context="_282" access="public" location="f0:269" file="f0" line="269"/>
  <Field id="_1061" name="sizeimage" type="_612" offset="160" context="_282" access="public" location="f0:270" file="f0" line="270"/>
  <Field id="_1062" name="colorspace" type="_667" offset="192" context="_282" access="public" location="f0:271" file="f0" line="271"/>
  <Field id="_1063" name="priv" type="_612" offset="224" context="_282" access="public" location="f0:272" file="f0" line="272"/>
  <Destructor id="_1064" name="v4l2_pix_format" artificial="1" throw="" context="_282" access="public" mangled="_ZN15v4l2_pix_formatD1Ev *INTERNAL* " demangled="v4l2_pix_format::~v4l2_pix_format()" location="f0:264" file="f0" line="264" endline="264" inline="1">
  </Destructor>
  <OperatorMethod id="_1065" name="=" returns="_1636" artificial="1" throw="" context="_282" access="public" mangled="_ZN15v4l2_pix_formataSERKS_" demangled="v4l2_pix_format::operator=(v4l2_pix_format const&amp;)" location="f0:264" file="f0" line="264" endline="264" inline="1">
    <Argument type="_1637" location="f0:264" file="f0" line="264"/>
  </OperatorMethod>
  <Constructor id="_1066" name="v4l2_pix_format" artificial="1" throw="" context="_282" access="public" mangled="_ZN15v4l2_pix_formatC1ERKS_ *INTERNAL* " demangled="v4l2_pix_format::v4l2_pix_format(v4l2_pix_format const&amp;)" location="f0:264" file="f0" line="264" endline="264" inline="1">
    <Argument type="_1637" location="f0:264" file="f0" line="264"/>
  </Constructor>
  <Constructor id="_1067" name="v4l2_pix_format" artificial="1" throw="" context="_282" access="public" mangled="_ZN15v4l2_pix_formatC1Ev *INTERNAL* " demangled="v4l2_pix_format::v4l2_pix_format()" location="f0:264" file="f0" line="264" inline="1"/>
  <Field id="_1068" name="index" type="_612" offset="0" context="_297" access="public" location="f0:519" file="f0" line="519"/>
  <Field id="_1069" name="type" type="_592" offset="32" context="_297" access="public" location="f0:520" file="f0" line="520"/>
  <Field id="_1070" name="bytesused" type="_612" offset="64" context="_297" access="public" location="f0:521" file="f0" line="521"/>
  <Field id="_1071" name="flags" type="_612" offset="96" context="_297" access="public" location="f0:522" file="f0" line="522"/>
  <Field id="_1072" name="field" type="_727" offset="128" context="_297" access="public" location="f0:523" file="f0" line="523"/>
  <Field id="_1073" name="timestamp" type="_10" offset="192" context="_297" access="public" location="f0:524" file="f0" line="524"/>
  <Field id="_1074" name="timecode" type="_751" offset="320" context="_297" access="public" location="f0:525" file="f0" line="525"/>
  <Field id="_1075" name="sequence" type="_612" offset="448" context="_297" access="public" location="f0:526" file="f0" line="526"/>
  <Field id="_1076" name="memory" type="_495" offset="480" context="_297" access="public" location="f0:529" file="f0" line="529"/>
  <Field id="_1077" name="m" type="_1081" offset="512" context="_297" access="public" location="f0:533" file="f0" line="533"/>
  <Field id="_1078" name="length" type="_612" offset="576" context="_297" access="public" location="f0:534" file="f0" line="534"/>
  <Field id="_1079" name="input" type="_612" offset="608" context="_297" access="public" location="f0:535" file="f0" line="535"/>
  <Field id="_1080" name="reserved" type="_612" offset="640" context="_297" access="public" location="f0:536" file="f0" line="536"/>
  <Union id="_1081" context="_297" access="public" mangled="N11v4l2_buffer3._7E" demangled="v4l2_buffer::._7" location="f0:530" file="f0" line="530" artificial="1" size="64" align="64" members="_1638 _1639 _1640 _1641 _1642 _1643 " bases=""/>
  <Destructor id="_1082" name="v4l2_buffer" artificial="1" throw="" context="_297" access="public" mangled="_ZN11v4l2_bufferD1Ev *INTERNAL* " demangled="v4l2_buffer::~v4l2_buffer()" location="f0:518" file="f0" line="518" endline="518" inline="1">
  </Destructor>
  <OperatorMethod id="_1083" name="=" returns="_1644" artificial="1" throw="" context="_297" access="public" mangled="_ZN11v4l2_bufferaSERKS_" demangled="v4l2_buffer::operator=(v4l2_buffer const&amp;)" location="f0:518" file="f0" line="518" endline="518" inline="1">
    <Argument type="_1645" location="f0:518" file="f0" line="518"/>
  </OperatorMethod>
  <Constructor id="_1084" name="v4l2_buffer" artificial="1" throw="" context="_297" access="public" mangled="_ZN11v4l2_bufferC1ERKS_ *INTERNAL* " demangled="v4l2_buffer::v4l2_buffer(v4l2_buffer const&amp;)" location="f0:518" file="f0" line="518" endline="518" inline="1">
    <Argument type="_1645" location="f0:518" file="f0" line="518"/>
  </Constructor>
  <Constructor id="_1085" name="v4l2_buffer" artificial="1" throw="" context="_297" access="public" mangled="_ZN11v4l2_bufferC1Ev *INTERNAL* " demangled="v4l2_buffer::v4l2_buffer()" location="f0:518" file="f0" line="518" inline="1"/>
  <PointerType id="_1086" type="_695" size="64" align="64"/>
  <CvQualifiedType id="_1086r" type="_1086" restrict="1"/>
  <Field id="_1088" name="line" type="_1646" offset="0" context="_302" access="public" location="f0:1574" file="f0" line="1574"/>
  <Destructor id="_1089" name="v4l2_mpeg_vbi_ITV0" artificial="1" throw="" context="_302" access="public" mangled="_ZN18v4l2_mpeg_vbi_ITV0D1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_ITV0::~v4l2_mpeg_vbi_ITV0()" location="f0:1573" file="f0" line="1573" endline="1573" inline="1">
  </Destructor>
  <OperatorMethod id="_1090" name="=" returns="_1647" artificial="1" throw="" context="_302" access="public" mangled="_ZN18v4l2_mpeg_vbi_ITV0aSERKS_" demangled="v4l2_mpeg_vbi_ITV0::operator=(v4l2_mpeg_vbi_ITV0 const&amp;)" location="f0:1573" file="f0" line="1573" endline="1573" inline="1">
    <Argument type="_1648" location="f0:1573" file="f0" line="1573"/>
  </OperatorMethod>
  <Constructor id="_1091" name="v4l2_mpeg_vbi_ITV0" artificial="1" throw="" context="_302" access="public" mangled="_ZN18v4l2_mpeg_vbi_ITV0C1ERKS_ *INTERNAL* " demangled="v4l2_mpeg_vbi_ITV0::v4l2_mpeg_vbi_ITV0(v4l2_mpeg_vbi_ITV0 const&amp;)" location="f0:1573" file="f0" line="1573" endline="1573" inline="1">
    <Argument type="_1648" location="f0:1573" file="f0" line="1573"/>
  </Constructor>
  <Constructor id="_1092" name="v4l2_mpeg_vbi_ITV0" artificial="1" throw="" context="_302" access="public" mangled="_ZN18v4l2_mpeg_vbi_ITV0C1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_ITV0::v4l2_mpeg_vbi_ITV0()" location="f0:1573" file="f0" line="1573" inline="1"/>
  <Field id="_1093" name="type" type="_592" offset="0" context="_307" access="public" location="f0:1595" file="f0" line="1595"/>
  <Field id="_1094" name="fmt" type="_1095" offset="64" context="_307" access="public" location="f0:1602" file="f0" line="1602"/>
  <Union id="_1095" context="_307" access="public" mangled="N11v4l2_format4._13E" demangled="v4l2_format::._13" location="f0:1596" file="f0" line="1596" artificial="1" size="1600" align="64" members="_1649 _1650 _1651 _1652 _1653 _1654 _1655 _1656 _1657 " bases=""/>
  <Destructor id="_1096" name="v4l2_format" artificial="1" throw="" context="_307" access="public" mangled="_ZN11v4l2_formatD1Ev *INTERNAL* " demangled="v4l2_format::~v4l2_format()" location="f0:1594" file="f0" line="1594" endline="1594" inline="1">
  </Destructor>
  <OperatorMethod id="_1097" name="=" returns="_1658" artificial="1" throw="" context="_307" access="public" mangled="_ZN11v4l2_formataSERKS_" demangled="v4l2_format::operator=(v4l2_format const&amp;)" location="f0:1594" file="f0" line="1594" endline="1594" inline="1">
    <Argument type="_1659" location="f0:1594" file="f0" line="1594"/>
  </OperatorMethod>
  <Constructor id="_1098" name="v4l2_format" artificial="1" throw="" context="_307" access="public" mangled="_ZN11v4l2_formatC1ERKS_ *INTERNAL* " demangled="v4l2_format::v4l2_format(v4l2_format const&amp;)" location="f0:1594" file="f0" line="1594" endline="1594" inline="1">
    <Argument type="_1659" location="f0:1594" file="f0" line="1594"/>
  </Constructor>
  <Constructor id="_1099" name="v4l2_format" artificial="1" throw="" context="_307" access="public" mangled="_ZN11v4l2_formatC1Ev *INTERNAL* " demangled="v4l2_format::v4l2_format()" location="f0:1594" file="f0" line="1594" inline="1"/>
  <Field id="_1100" name="__pos" type="_671" offset="0" context="_311" access="public" location="f15:29" file="f15" line="29"/>
  <Field id="_1101" name="__state" type="_389" offset="64" context="_311" access="public" location="f15:30" file="f15" line="30"/>
  <Destructor id="_1102" name="._19" artificial="1" throw="" context="_311" access="public" mangled="_ZN11_G_fpos64_tD1Ev *INTERNAL* " demangled="_G_fpos64_t::~_G_fpos64_t()" location="f15:31" file="f15" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1103" name="=" returns="_1660" artificial="1" throw="" context="_311" access="public" mangled="_ZN11_G_fpos64_taSERKS_" demangled="_G_fpos64_t::operator=(_G_fpos64_t const&amp;)" location="f15:31" file="f15" line="31" endline="31" inline="1">
    <Argument type="_1661" location="f15:28" file="f15" line="28"/>
  </OperatorMethod>
  <Constructor id="_1104" name="._19" artificial="1" throw="" context="_311" access="public" mangled="_ZN11_G_fpos64_tC1ERKS_ *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t(_G_fpos64_t const&amp;)" location="f15:31" file="f15" line="31" endline="31" inline="1">
    <Argument type="_1661" location="f15:28" file="f15" line="28"/>
  </Constructor>
  <Constructor id="_1105" name="._19" artificial="1" throw="" context="_311" access="public" mangled="_ZN11_G_fpos64_tC1Ev *INTERNAL* " demangled="_G_fpos64_t::_G_fpos64_t()" location="f15:31" file="f15" line="31" inline="1"/>
  <Field id="_1106" name="driver" type="_1662" offset="0" context="_316" access="public" location="f0:231" file="f0" line="231"/>
  <Field id="_1107" name="card" type="_1573" offset="128" context="_316" access="public" location="f0:232" file="f0" line="232"/>
  <Field id="_1108" name="bus_info" type="_1573" offset="384" context="_316" access="public" location="f0:233" file="f0" line="233"/>
  <Field id="_1109" name="version" type="_612" offset="640" context="_316" access="public" location="f0:234" file="f0" line="234"/>
  <Field id="_1110" name="capabilities" type="_612" offset="672" context="_316" access="public" location="f0:235" file="f0" line="235"/>
  <Field id="_1111" name="reserved" type="_1663" offset="704" context="_316" access="public" location="f0:236" file="f0" line="236"/>
  <Destructor id="_1112" name="v4l2_capability" artificial="1" throw="" context="_316" access="public" mangled="_ZN15v4l2_capabilityD1Ev *INTERNAL* " demangled="v4l2_capability::~v4l2_capability()" location="f0:230" file="f0" line="230" endline="230" inline="1">
  </Destructor>
  <OperatorMethod id="_1113" name="=" returns="_1664" artificial="1" throw="" context="_316" access="public" mangled="_ZN15v4l2_capabilityaSERKS_" demangled="v4l2_capability::operator=(v4l2_capability const&amp;)" location="f0:230" file="f0" line="230" endline="230" inline="1">
    <Argument type="_1665" location="f0:230" file="f0" line="230"/>
  </OperatorMethod>
  <Constructor id="_1114" name="v4l2_capability" artificial="1" throw="" context="_316" access="public" mangled="_ZN15v4l2_capabilityC1ERKS_ *INTERNAL* " demangled="v4l2_capability::v4l2_capability(v4l2_capability const&amp;)" location="f0:230" file="f0" line="230" endline="230" inline="1">
    <Argument type="_1665" location="f0:230" file="f0" line="230"/>
  </Constructor>
  <Constructor id="_1115" name="v4l2_capability" artificial="1" throw="" context="_316" access="public" mangled="_ZN15v4l2_capabilityC1Ev *INTERNAL* " demangled="v4l2_capability::v4l2_capability()" location="f0:230" file="f0" line="230" inline="1"/>
  <Field id="_1116" name="type" type="_612" offset="0" context="_326" access="public" location="f0:818" file="f0" line="818"/>
  <Field id="_1117" name="" type="_1118" offset="32" context="_326" access="public" location="f0:822" file="f0" line="822"/>
  <Union id="_1118" context="_326" access="public" mangled="N15v4l2_dv_timings3._8E" demangled="v4l2_dv_timings::._8" location="f0:819" file="f0" line="819" artificial="1" size="1024" align="32" members="_1666 _1667 " bases=""/>
  <Destructor id="_1119" name="v4l2_dv_timings" artificial="1" throw="" context="_326" access="public" mangled="_ZN15v4l2_dv_timingsD1Ev *INTERNAL* " demangled="v4l2_dv_timings::~v4l2_dv_timings()" location="f0:817" file="f0" line="817" endline="817" inline="1">
  </Destructor>
  <OperatorMethod id="_1120" name="=" returns="_1668" artificial="1" throw="" context="_326" access="public" mangled="_ZN15v4l2_dv_timingsaSERKS_" demangled="v4l2_dv_timings::operator=(v4l2_dv_timings const&amp;)" location="f0:817" file="f0" line="817" endline="817" inline="1">
    <Argument type="_1669" location="f0:817" file="f0" line="817"/>
  </OperatorMethod>
  <Constructor id="_1121" name="v4l2_dv_timings" artificial="1" throw="" context="_326" access="public" mangled="_ZN15v4l2_dv_timingsC1ERKS_ *INTERNAL* " demangled="v4l2_dv_timings::v4l2_dv_timings(v4l2_dv_timings const&amp;)" location="f0:817" file="f0" line="817" endline="817" inline="1">
    <Argument type="_1669" location="f0:817" file="f0" line="817"/>
  </Constructor>
  <Constructor id="_1122" name="v4l2_dv_timings" artificial="1" throw="" context="_326" access="public" mangled="_ZN15v4l2_dv_timingsC1Ev *INTERNAL* " demangled="v4l2_dv_timings::v4l2_dv_timings()" location="f0:817" file="f0" line="817" inline="1"/>
  <PointerType id="_1123" type="_836" size="64" align="64"/>
  <PointerType id="_1124" type="_837" size="64" align="64"/>
  <Field id="_1125" name="width" type="_88" offset="0" context="_336" access="public" location="f6:136" file="f6" line="136"/>
  <Field id="_1126" name="height" type="_88" offset="32" context="_336" access="public" location="f6:137" file="f6" line="137"/>
  <Destructor id="_1127" name="._25" artificial="1" throw="" context="_336" access="public" mangled="_ZN7fg_sizeD1Ev *INTERNAL* " demangled="fg_size::~fg_size()" location="f6:139" file="f6" line="139" endline="139" inline="1">
  </Destructor>
  <OperatorMethod id="_1128" name="=" returns="_1670" artificial="1" throw="" context="_336" access="public" mangled="_ZN7fg_sizeaSERKS_" demangled="fg_size::operator=(fg_size const&amp;)" location="f6:139" file="f6" line="139" endline="139" inline="1">
    <Argument type="_1671" location="f6:135" file="f6" line="135"/>
  </OperatorMethod>
  <Constructor id="_1129" name="._25" artificial="1" throw="" context="_336" access="public" mangled="_ZN7fg_sizeC1ERKS_ *INTERNAL* " demangled="fg_size::fg_size(fg_size const&amp;)" location="f6:139" file="f6" line="139" endline="139" inline="1">
    <Argument type="_1671" location="f6:135" file="f6" line="135"/>
  </Constructor>
  <Constructor id="_1130" name="._25" artificial="1" throw="" context="_336" access="public" mangled="_ZN7fg_sizeC1Ev *INTERNAL* " demangled="fg_size::fg_size()" location="f6:139" file="f6" line="139" inline="1"/>
  <Field id="_1131" name="fds_bits" type="_1589" offset="0" context="_347" access="public" location="f14:37" file="f14" line="37"/>
  <Destructor id="_1132" name="._3" artificial="1" throw="" context="_347" access="public" mangled="_ZN15__kernel_fd_setD1Ev *INTERNAL* " demangled="__kernel_fd_set::~__kernel_fd_set()" location="f14:38" file="f14" line="38" endline="38" inline="1">
  </Destructor>
  <OperatorMethod id="_1133" name="=" returns="_1672" artificial="1" throw="" context="_347" access="public" mangled="_ZN15__kernel_fd_setaSERKS_" demangled="__kernel_fd_set::operator=(__kernel_fd_set const&amp;)" location="f14:38" file="f14" line="38" endline="38" inline="1">
    <Argument type="_1673" location="f14:36" file="f14" line="36"/>
  </OperatorMethod>
  <Constructor id="_1134" name="._3" artificial="1" throw="" context="_347" access="public" mangled="_ZN15__kernel_fd_setC1ERKS_ *INTERNAL* " demangled="__kernel_fd_set::__kernel_fd_set(__kernel_fd_set const&amp;)" location="f14:38" file="f14" line="38" endline="38" inline="1">
    <Argument type="_1673" location="f14:36" file="f14" line="36"/>
  </Constructor>
  <Constructor id="_1135" name="._3" artificial="1" throw="" context="_347" access="public" mangled="_ZN15__kernel_fd_setC1Ev *INTERNAL* " demangled="__kernel_fd_set::__kernel_fd_set()" location="f14:38" file="f14" line="38" inline="1"/>
  <PointerType id="_1136" type="_682" size="64" align="64"/>
  <Field id="_1137" name="index" type="_612" offset="0" context="_349" access="public" location="f0:880" file="f0" line="880"/>
  <Field id="_1138" name="name" type="_1573" offset="32" context="_349" access="public" location="f0:881" file="f0" line="881"/>
  <Field id="_1139" name="type" type="_612" offset="288" context="_349" access="public" location="f0:882" file="f0" line="882"/>
  <Field id="_1140" name="audioset" type="_612" offset="320" context="_349" access="public" location="f0:883" file="f0" line="883"/>
  <Field id="_1141" name="modulator" type="_612" offset="352" context="_349" access="public" location="f0:884" file="f0" line="884"/>
  <Field id="_1142" name="std" type="_376" offset="384" context="_349" access="public" location="f0:885" file="f0" line="885"/>
  <Field id="_1143" name="capabilities" type="_612" offset="448" context="_349" access="public" location="f0:886" file="f0" line="886"/>
  <Field id="_1144" name="reserved" type="_1593" offset="480" context="_349" access="public" location="f0:887" file="f0" line="887"/>
  <Destructor id="_1145" name="v4l2_output" artificial="1" throw="" context="_349" access="public" mangled="_ZN11v4l2_outputD1Ev *INTERNAL* " demangled="v4l2_output::~v4l2_output()" location="f0:879" file="f0" line="879" endline="879" inline="1">
  </Destructor>
  <OperatorMethod id="_1146" name="=" returns="_1674" artificial="1" throw="" context="_349" access="public" mangled="_ZN11v4l2_outputaSERKS_" demangled="v4l2_output::operator=(v4l2_output const&amp;)" location="f0:879" file="f0" line="879" endline="879" inline="1">
    <Argument type="_1675" location="f0:879" file="f0" line="879"/>
  </OperatorMethod>
  <Constructor id="_1147" name="v4l2_output" artificial="1" throw="" context="_349" access="public" mangled="_ZN11v4l2_outputC1ERKS_ *INTERNAL* " demangled="v4l2_output::v4l2_output(v4l2_output const&amp;)" location="f0:879" file="f0" line="879" endline="879" inline="1">
    <Argument type="_1675" location="f0:879" file="f0" line="879"/>
  </Constructor>
  <Constructor id="_1148" name="v4l2_output" artificial="1" throw="" context="_349" access="public" mangled="_ZN11v4l2_outputC1Ev *INTERNAL* " demangled="v4l2_output::v4l2_output()" location="f0:879" file="f0" line="879" inline="1"/>
  <Field id="_1149" name="match" type="_3" offset="0" context="_353" access="public" location="f0:1648" file="f0" line="1648"/>
  <Field id="_1150" name="ident" type="_612" offset="288" context="_353" access="public" location="f0:1649" file="f0" line="1649"/>
  <Field id="_1151" name="revision" type="_612" offset="320" context="_353" access="public" location="f0:1650" file="f0" line="1650"/>
  <Destructor id="_1152" name="v4l2_dbg_chip_ident" artificial="1" throw="" context="_353" access="public" mangled="_ZN19v4l2_dbg_chip_identD1Ev *INTERNAL* " demangled="v4l2_dbg_chip_ident::~v4l2_dbg_chip_ident()" location="f0:1647" file="f0" line="1647" endline="1647" inline="1">
  </Destructor>
  <OperatorMethod id="_1153" name="=" returns="_1676" artificial="1" throw="" context="_353" access="public" mangled="_ZN19v4l2_dbg_chip_identaSERKS_" demangled="v4l2_dbg_chip_ident::operator=(v4l2_dbg_chip_ident const&amp;)" location="f0:1647" file="f0" line="1647" endline="1647" inline="1">
    <Argument type="_1677" location="f0:1647" file="f0" line="1647"/>
  </OperatorMethod>
  <Constructor id="_1154" name="v4l2_dbg_chip_ident" artificial="1" throw="" context="_353" access="public" mangled="_ZN19v4l2_dbg_chip_identC1ERKS_ *INTERNAL* " demangled="v4l2_dbg_chip_ident::v4l2_dbg_chip_ident(v4l2_dbg_chip_ident const&amp;)" location="f0:1647" file="f0" line="1647" endline="1647" inline="1">
    <Argument type="_1677" location="f0:1647" file="f0" line="1647"/>
  </Constructor>
  <Constructor id="_1155" name="v4l2_dbg_chip_ident" artificial="1" throw="" context="_353" access="public" mangled="_ZN19v4l2_dbg_chip_identC1Ev *INTERNAL* " demangled="v4l2_dbg_chip_ident::v4l2_dbg_chip_ident()" location="f0:1647" file="f0" line="1647" inline="1"/>
  <Field id="_1156" name="min_width" type="_612" offset="0" context="_356" access="public" location="f0:399" file="f0" line="399"/>
  <Field id="_1157" name="max_width" type="_612" offset="32" context="_356" access="public" location="f0:400" file="f0" line="400"/>
  <Field id="_1158" name="step_width" type="_612" offset="64" context="_356" access="public" location="f0:401" file="f0" line="401"/>
  <Field id="_1159" name="min_height" type="_612" offset="96" context="_356" access="public" location="f0:402" file="f0" line="402"/>
  <Field id="_1160" name="max_height" type="_612" offset="128" context="_356" access="public" location="f0:403" file="f0" line="403"/>
  <Field id="_1161" name="step_height" type="_612" offset="160" context="_356" access="public" location="f0:404" file="f0" line="404"/>
  <Destructor id="_1162" name="v4l2_frmsize_stepwise" artificial="1" throw="" context="_356" access="public" mangled="_ZN21v4l2_frmsize_stepwiseD1Ev *INTERNAL* " demangled="v4l2_frmsize_stepwise::~v4l2_frmsize_stepwise()" location="f0:398" file="f0" line="398" endline="398" inline="1">
  </Destructor>
  <OperatorMethod id="_1163" name="=" returns="_1678" artificial="1" throw="" context="_356" access="public" mangled="_ZN21v4l2_frmsize_stepwiseaSERKS_" demangled="v4l2_frmsize_stepwise::operator=(v4l2_frmsize_stepwise const&amp;)" location="f0:398" file="f0" line="398" endline="398" inline="1">
    <Argument type="_1679" location="f0:398" file="f0" line="398"/>
  </OperatorMethod>
  <Constructor id="_1164" name="v4l2_frmsize_stepwise" artificial="1" throw="" context="_356" access="public" mangled="_ZN21v4l2_frmsize_stepwiseC1ERKS_ *INTERNAL* " demangled="v4l2_frmsize_stepwise::v4l2_frmsize_stepwise(v4l2_frmsize_stepwise const&amp;)" location="f0:398" file="f0" line="398" endline="398" inline="1">
    <Argument type="_1679" location="f0:398" file="f0" line="398"/>
  </Constructor>
  <Constructor id="_1165" name="v4l2_frmsize_stepwise" artificial="1" throw="" context="_356" access="public" mangled="_ZN21v4l2_frmsize_stepwiseC1Ev *INTERNAL* " demangled="v4l2_frmsize_stepwise::v4l2_frmsize_stepwise()" location="f0:398" file="f0" line="398" inline="1"/>
  <Field id="_1166" name="width" type="_612" offset="0" context="_359" access="public" location="f0:784" file="f0" line="784"/>
  <Field id="_1167" name="height" type="_612" offset="32" context="_359" access="public" location="f0:785" file="f0" line="785"/>
  <Field id="_1168" name="interlaced" type="_612" offset="64" context="_359" access="public" location="f0:786" file="f0" line="786"/>
  <Field id="_1169" name="polarities" type="_612" offset="96" context="_359" access="public" location="f0:787" file="f0" line="787"/>
  <Field id="_1170" name="pixelclock" type="_624" offset="128" context="_359" access="public" location="f0:788" file="f0" line="788"/>
  <Field id="_1171" name="hfrontporch" type="_612" offset="192" context="_359" access="public" location="f0:789" file="f0" line="789"/>
  <Field id="_1172" name="hsync" type="_612" offset="224" context="_359" access="public" location="f0:790" file="f0" line="790"/>
  <Field id="_1173" name="hbackporch" type="_612" offset="256" context="_359" access="public" location="f0:791" file="f0" line="791"/>
  <Field id="_1174" name="vfrontporch" type="_612" offset="288" context="_359" access="public" location="f0:792" file="f0" line="792"/>
  <Field id="_1175" name="vsync" type="_612" offset="320" context="_359" access="public" location="f0:793" file="f0" line="793"/>
  <Field id="_1176" name="vbackporch" type="_612" offset="352" context="_359" access="public" location="f0:794" file="f0" line="794"/>
  <Field id="_1177" name="il_vfrontporch" type="_612" offset="384" context="_359" access="public" location="f0:795" file="f0" line="795"/>
  <Field id="_1178" name="il_vsync" type="_612" offset="416" context="_359" access="public" location="f0:798" file="f0" line="798"/>
  <Field id="_1179" name="il_vbackporch" type="_612" offset="448" context="_359" access="public" location="f0:801" file="f0" line="801"/>
  <Field id="_1180" name="reserved" type="_1680" offset="480" context="_359" access="public" location="f0:804" file="f0" line="804"/>
  <Destructor id="_1181" name="v4l2_bt_timings" artificial="1" throw="" context="_359" access="public" mangled="_ZN15v4l2_bt_timingsD1Ev *INTERNAL* " demangled="v4l2_bt_timings::~v4l2_bt_timings()" location="f0:783" file="f0" line="783" endline="783" inline="1">
  </Destructor>
  <OperatorMethod id="_1182" name="=" returns="_1681" artificial="1" throw="" context="_359" access="public" mangled="_ZN15v4l2_bt_timingsaSERKS_" demangled="v4l2_bt_timings::operator=(v4l2_bt_timings const&amp;)" location="f0:783" file="f0" line="783" endline="783" inline="1">
    <Argument type="_1682" location="f0:783" file="f0" line="783"/>
  </OperatorMethod>
  <Constructor id="_1183" name="v4l2_bt_timings" artificial="1" throw="" context="_359" access="public" mangled="_ZN15v4l2_bt_timingsC1ERKS_ *INTERNAL* " demangled="v4l2_bt_timings::v4l2_bt_timings(v4l2_bt_timings const&amp;)" location="f0:783" file="f0" line="783" endline="783" inline="1">
    <Argument type="_1682" location="f0:783" file="f0" line="783"/>
  </Constructor>
  <Constructor id="_1184" name="v4l2_bt_timings" artificial="1" throw="" context="_359" access="public" mangled="_ZN15v4l2_bt_timingsC1Ev *INTERNAL* " demangled="v4l2_bt_timings::v4l2_bt_timings()" location="f0:783" file="f0" line="783" inline="1"/>
  <PointerType id="_1185" type="_582c" size="64" align="64"/>
  <Field id="_1186" name="index" type="_612" offset="0" context="_365" access="public" location="f0:747" file="f0" line="747"/>
  <Field id="_1187" name="preset" type="_612" offset="32" context="_365" access="public" location="f0:748" file="f0" line="748"/>
  <Field id="_1188" name="name" type="_1573" offset="64" context="_365" access="public" location="f0:749" file="f0" line="749"/>
  <Field id="_1189" name="width" type="_612" offset="320" context="_365" access="public" location="f0:750" file="f0" line="750"/>
  <Field id="_1190" name="height" type="_612" offset="352" context="_365" access="public" location="f0:751" file="f0" line="751"/>
  <Field id="_1191" name="reserved" type="_1663" offset="384" context="_365" access="public" location="f0:752" file="f0" line="752"/>
  <Destructor id="_1192" name="v4l2_dv_enum_preset" artificial="1" throw="" context="_365" access="public" mangled="_ZN19v4l2_dv_enum_presetD1Ev *INTERNAL* " demangled="v4l2_dv_enum_preset::~v4l2_dv_enum_preset()" location="f0:746" file="f0" line="746" endline="746" inline="1">
  </Destructor>
  <OperatorMethod id="_1193" name="=" returns="_1684" artificial="1" throw="" context="_365" access="public" mangled="_ZN19v4l2_dv_enum_presetaSERKS_" demangled="v4l2_dv_enum_preset::operator=(v4l2_dv_enum_preset const&amp;)" location="f0:746" file="f0" line="746" endline="746" inline="1">
    <Argument type="_1685" location="f0:746" file="f0" line="746"/>
  </OperatorMethod>
  <Constructor id="_1194" name="v4l2_dv_enum_preset" artificial="1" throw="" context="_365" access="public" mangled="_ZN19v4l2_dv_enum_presetC1ERKS_ *INTERNAL* " demangled="v4l2_dv_enum_preset::v4l2_dv_enum_preset(v4l2_dv_enum_preset const&amp;)" location="f0:746" file="f0" line="746" endline="746" inline="1">
    <Argument type="_1685" location="f0:746" file="f0" line="746"/>
  </Constructor>
  <Constructor id="_1195" name="v4l2_dv_enum_preset" artificial="1" throw="" context="_365" access="public" mangled="_ZN19v4l2_dv_enum_presetC1Ev *INTERNAL* " demangled="v4l2_dv_enum_preset::v4l2_dv_enum_preset()" location="f0:746" file="f0" line="746" inline="1"/>
  <Field id="_1196" name="type" type="_592" offset="0" context="_377" access="public" location="f0:629" file="f0" line="629"/>
  <Field id="_1197" name="c" type="_26" offset="32" context="_377" access="public" location="f0:630" file="f0" line="630"/>
  <Destructor id="_1198" name="v4l2_crop" artificial="1" throw="" context="_377" access="public" mangled="_ZN9v4l2_cropD1Ev *INTERNAL* " demangled="v4l2_crop::~v4l2_crop()" location="f0:628" file="f0" line="628" endline="628" inline="1">
  </Destructor>
  <OperatorMethod id="_1199" name="=" returns="_1686" artificial="1" throw="" context="_377" access="public" mangled="_ZN9v4l2_cropaSERKS_" demangled="v4l2_crop::operator=(v4l2_crop const&amp;)" location="f0:628" file="f0" line="628" endline="628" inline="1">
    <Argument type="_1687" location="f0:628" file="f0" line="628"/>
  </OperatorMethod>
  <Constructor id="_1200" name="v4l2_crop" artificial="1" throw="" context="_377" access="public" mangled="_ZN9v4l2_cropC1ERKS_ *INTERNAL* " demangled="v4l2_crop::v4l2_crop(v4l2_crop const&amp;)" location="f0:628" file="f0" line="628" endline="628" inline="1">
    <Argument type="_1687" location="f0:628" file="f0" line="628"/>
  </Constructor>
  <Constructor id="_1201" name="v4l2_crop" artificial="1" throw="" context="_377" access="public" mangled="_ZN9v4l2_cropC1Ev *INTERNAL* " demangled="v4l2_crop::v4l2_crop()" location="f0:628" file="f0" line="628" inline="1"/>
  <Field id="_1202" name="tv_sec" type="_497" offset="0" context="_379" access="public" location="f13:122" file="f13" line="122"/>
  <Field id="_1203" name="tv_nsec" type="_55" offset="64" context="_379" access="public" location="f13:123" file="f13" line="123"/>
  <Destructor id="_1204" name="timespec" artificial="1" throw="" context="_379" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f13:121" file="f13" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_1205" name="=" returns="_1688" artificial="1" throw="" context="_379" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f13:121" file="f13" line="121" endline="121" inline="1">
    <Argument type="_1689" location="f13:121" file="f13" line="121"/>
  </OperatorMethod>
  <Constructor id="_1206" name="timespec" artificial="1" throw="" context="_379" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f13:121" file="f13" line="121" endline="121" inline="1">
    <Argument type="_1689" location="f13:121" file="f13" line="121"/>
  </Constructor>
  <Constructor id="_1207" name="timespec" artificial="1" throw="" context="_379" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f13:121" file="f13" line="121" inline="1"/>
  <Field id="_1208" name="lsb" type="_566" offset="0" context="_382" access="public" location="f0:1378" file="f0" line="1378"/>
  <Field id="_1209" name="msb" type="_566" offset="8" context="_382" access="public" location="f0:1379" file="f0" line="1379"/>
  <Field id="_1210" name="block" type="_566" offset="16" context="_382" access="public" location="f0:1380" file="f0" line="1380"/>
  <Destructor id="_1211" name="v4l2_rds_data" artificial="1" throw="" context="_382" access="public" mangled="_ZN13v4l2_rds_dataD1Ev *INTERNAL* " demangled="v4l2_rds_data::~v4l2_rds_data()" location="f0:1377" file="f0" line="1377" endline="1377" inline="1">
  </Destructor>
  <OperatorMethod id="_1212" name="=" returns="_1690" artificial="1" throw="" context="_382" access="public" mangled="_ZN13v4l2_rds_dataaSERKS_" demangled="v4l2_rds_data::operator=(v4l2_rds_data const&amp;)" location="f0:1377" file="f0" line="1377" endline="1377" inline="1">
    <Argument type="_1691" location="f0:1377" file="f0" line="1377"/>
  </OperatorMethod>
  <Constructor id="_1213" name="v4l2_rds_data" artificial="1" throw="" context="_382" access="public" mangled="_ZN13v4l2_rds_dataC1ERKS_ *INTERNAL* " demangled="v4l2_rds_data::v4l2_rds_data(v4l2_rds_data const&amp;)" location="f0:1377" file="f0" line="1377" endline="1377" inline="1">
    <Argument type="_1691" location="f0:1377" file="f0" line="1377"/>
  </Constructor>
  <Constructor id="_1214" name="v4l2_rds_data" artificial="1" throw="" context="_382" access="public" mangled="_ZN13v4l2_rds_dataC1Ev *INTERNAL* " demangled="v4l2_rds_data::v4l2_rds_data()" location="f0:1377" file="f0" line="1377" inline="1"/>
  <Field id="_1215" name="ctrl_class" type="_612" offset="0" context="_384" access="public" location="f0:919" file="f0" line="919"/>
  <Field id="_1216" name="count" type="_612" offset="32" context="_384" access="public" location="f0:920" file="f0" line="920"/>
  <Field id="_1217" name="error_idx" type="_612" offset="64" context="_384" access="public" location="f0:921" file="f0" line="921"/>
  <Field id="_1218" name="reserved" type="_1596" offset="96" context="_384" access="public" location="f0:922" file="f0" line="922"/>
  <Field id="_1219" name="controls" type="_1692" offset="192" context="_384" access="public" location="f0:923" file="f0" line="923"/>
  <Destructor id="_1220" name="v4l2_ext_controls" artificial="1" throw="" context="_384" access="public" mangled="_ZN17v4l2_ext_controlsD1Ev *INTERNAL* " demangled="v4l2_ext_controls::~v4l2_ext_controls()" location="f0:918" file="f0" line="918" endline="918" inline="1">
  </Destructor>
  <OperatorMethod id="_1221" name="=" returns="_1693" artificial="1" throw="" context="_384" access="public" mangled="_ZN17v4l2_ext_controlsaSERKS_" demangled="v4l2_ext_controls::operator=(v4l2_ext_controls const&amp;)" location="f0:918" file="f0" line="918" endline="918" inline="1">
    <Argument type="_1694" location="f0:918" file="f0" line="918"/>
  </OperatorMethod>
  <Constructor id="_1222" name="v4l2_ext_controls" artificial="1" throw="" context="_384" access="public" mangled="_ZN17v4l2_ext_controlsC1ERKS_ *INTERNAL* " demangled="v4l2_ext_controls::v4l2_ext_controls(v4l2_ext_controls const&amp;)" location="f0:918" file="f0" line="918" endline="918" inline="1">
    <Argument type="_1694" location="f0:918" file="f0" line="918"/>
  </Constructor>
  <Constructor id="_1223" name="v4l2_ext_controls" artificial="1" throw="" context="_384" access="public" mangled="_ZN17v4l2_ext_controlsC1Ev *INTERNAL* " demangled="v4l2_ext_controls::v4l2_ext_controls()" location="f0:918" file="f0" line="918" inline="1"/>
  <Field id="_1224" name="__count" type="_45" offset="0" context="_389" access="public" location="f21:85" file="f21" line="85"/>
  <Field id="_1225" name="__value" type="_1226" offset="32" context="_389" access="public" location="f21:94" file="f21" line="94"/>
  <Union id="_1226" context="_389" access="public" mangled="N11__mbstate_t4._17E" demangled="__mbstate_t::._17" location="f21:87" file="f21" line="87" artificial="1" size="32" align="32" members="_1695 _1696 _1697 _1698 _1699 _1700 " bases=""/>
  <Destructor id="_1227" name="._16" artificial="1" throw="" context="_389" access="public" mangled="_ZN11__mbstate_tD1Ev *INTERNAL* " demangled="__mbstate_t::~__mbstate_t()" location="f21:95" file="f21" line="95" endline="95" inline="1">
  </Destructor>
  <OperatorMethod id="_1228" name="=" returns="_1701" artificial="1" throw="" context="_389" access="public" mangled="_ZN11__mbstate_taSERKS_" demangled="__mbstate_t::operator=(__mbstate_t const&amp;)" location="f21:95" file="f21" line="95" endline="95" inline="1">
    <Argument type="_1702" location="f21:84" file="f21" line="84"/>
  </OperatorMethod>
  <Constructor id="_1229" name="._16" artificial="1" throw="" context="_389" access="public" mangled="_ZN11__mbstate_tC1ERKS_ *INTERNAL* " demangled="__mbstate_t::__mbstate_t(__mbstate_t const&amp;)" location="f21:95" file="f21" line="95" endline="95" inline="1">
    <Argument type="_1702" location="f21:84" file="f21" line="84"/>
  </Constructor>
  <Constructor id="_1230" name="._16" artificial="1" throw="" context="_389" access="public" mangled="_ZN11__mbstate_tC1Ev *INTERNAL* " demangled="__mbstate_t::__mbstate_t()" location="f21:95" file="f21" line="95" inline="1"/>
  <Field id="_1231" name="index" type="_612" offset="0" context="_401" access="public" location="f0:1413" file="f0" line="1413"/>
  <Field id="_1232" name="name" type="_1573" offset="32" context="_401" access="public" location="f0:1414" file="f0" line="1414"/>
  <Field id="_1233" name="capability" type="_612" offset="288" context="_401" access="public" location="f0:1415" file="f0" line="1415"/>
  <Field id="_1234" name="mode" type="_612" offset="320" context="_401" access="public" location="f0:1416" file="f0" line="1416"/>
  <Field id="_1235" name="reserved" type="_1596" offset="352" context="_401" access="public" location="f0:1417" file="f0" line="1417"/>
  <Destructor id="_1236" name="v4l2_audioout" artificial="1" throw="" context="_401" access="public" mangled="_ZN13v4l2_audiooutD1Ev *INTERNAL* " demangled="v4l2_audioout::~v4l2_audioout()" location="f0:1412" file="f0" line="1412" endline="1412" inline="1">
  </Destructor>
  <OperatorMethod id="_1237" name="=" returns="_1703" artificial="1" throw="" context="_401" access="public" mangled="_ZN13v4l2_audiooutaSERKS_" demangled="v4l2_audioout::operator=(v4l2_audioout const&amp;)" location="f0:1412" file="f0" line="1412" endline="1412" inline="1">
    <Argument type="_1704" location="f0:1412" file="f0" line="1412"/>
  </OperatorMethod>
  <Constructor id="_1238" name="v4l2_audioout" artificial="1" throw="" context="_401" access="public" mangled="_ZN13v4l2_audiooutC1ERKS_ *INTERNAL* " demangled="v4l2_audioout::v4l2_audioout(v4l2_audioout const&amp;)" location="f0:1412" file="f0" line="1412" endline="1412" inline="1">
    <Argument type="_1704" location="f0:1412" file="f0" line="1412"/>
  </Constructor>
  <Constructor id="_1239" name="v4l2_audioout" artificial="1" throw="" context="_401" access="public" mangled="_ZN13v4l2_audiooutC1Ev *INTERNAL* " demangled="v4l2_audioout::v4l2_audioout()" location="f0:1412" file="f0" line="1412" inline="1"/>
  <PointerType id="_1240" type="_198" size="64" align="64"/>
  <CvQualifiedType id="_1240r" type="_1240" restrict="1"/>
  <PointerType id="_1242" type="_379c" size="64" align="64"/>
  <CvQualifiedType id="_1242r" type="_1242" restrict="1"/>
  <PointerType id="_1244" type="_68c" size="64" align="64"/>
  <CvQualifiedType id="_1244r" type="_1244" restrict="1"/>
  <PointerType id="_1246" type="_695c" size="64" align="64"/>
  <Field id="_1247" name="red" type="_1294" offset="0" context="_427" access="public" location="f6:146" file="f6" line="146"/>
  <Field id="_1248" name="green" type="_1294" offset="8" context="_427" access="public" location="f6:147" file="f6" line="147"/>
  <Field id="_1249" name="blue" type="_1294" offset="16" context="_427" access="public" location="f6:148" file="f6" line="148"/>
  <Destructor id="_1250" name="._26" artificial="1" throw="" context="_427" access="public" mangled="_ZN6fg_rgbD1Ev *INTERNAL* " demangled="fg_rgb::~fg_rgb()" location="f6:150" file="f6" line="150" endline="150" inline="1">
  </Destructor>
  <OperatorMethod id="_1251" name="=" returns="_1708" artificial="1" throw="" context="_427" access="public" mangled="_ZN6fg_rgbaSERKS_" demangled="fg_rgb::operator=(fg_rgb const&amp;)" location="f6:150" file="f6" line="150" endline="150" inline="1">
    <Argument type="_1709" location="f6:145" file="f6" line="145"/>
  </OperatorMethod>
  <Constructor id="_1252" name="._26" artificial="1" throw="" context="_427" access="public" mangled="_ZN6fg_rgbC1ERKS_ *INTERNAL* " demangled="fg_rgb::fg_rgb(fg_rgb const&amp;)" location="f6:150" file="f6" line="150" endline="150" inline="1">
    <Argument type="_1709" location="f6:145" file="f6" line="145"/>
  </Constructor>
  <Constructor id="_1253" name="._26" artificial="1" throw="" context="_427" access="public" mangled="_ZN6fg_rgbC1Ev *INTERNAL* " demangled="fg_rgb::fg_rgb()" location="f6:150" file="f6" line="150" inline="1"/>
  <Field id="_1254" name="preset" type="_612" offset="0" context="_431" access="public" location="f0:739" file="f0" line="739"/>
  <Field id="_1255" name="reserved" type="_1663" offset="32" context="_431" access="public" location="f0:740" file="f0" line="740"/>
  <Destructor id="_1256" name="v4l2_dv_preset" artificial="1" throw="" context="_431" access="public" mangled="_ZN14v4l2_dv_presetD1Ev *INTERNAL* " demangled="v4l2_dv_preset::~v4l2_dv_preset()" location="f0:738" file="f0" line="738" endline="738" inline="1">
  </Destructor>
  <OperatorMethod id="_1257" name="=" returns="_1710" artificial="1" throw="" context="_431" access="public" mangled="_ZN14v4l2_dv_presetaSERKS_" demangled="v4l2_dv_preset::operator=(v4l2_dv_preset const&amp;)" location="f0:738" file="f0" line="738" endline="738" inline="1">
    <Argument type="_1711" location="f0:738" file="f0" line="738"/>
  </OperatorMethod>
  <Constructor id="_1258" name="v4l2_dv_preset" artificial="1" throw="" context="_431" access="public" mangled="_ZN14v4l2_dv_presetC1ERKS_ *INTERNAL* " demangled="v4l2_dv_preset::v4l2_dv_preset(v4l2_dv_preset const&amp;)" location="f0:738" file="f0" line="738" endline="738" inline="1">
    <Argument type="_1711" location="f0:738" file="f0" line="738"/>
  </Constructor>
  <Constructor id="_1259" name="v4l2_dv_preset" artificial="1" throw="" context="_431" access="public" mangled="_ZN14v4l2_dv_presetC1Ev *INTERNAL* " demangled="v4l2_dv_preset::v4l2_dv_preset()" location="f0:738" file="f0" line="738" inline="1"/>
  <Field id="_1260" name="index" type="_612" offset="0" context="_435" access="public" location="f0:832" file="f0" line="832"/>
  <Field id="_1261" name="name" type="_1573" offset="32" context="_435" access="public" location="f0:833" file="f0" line="833"/>
  <Field id="_1262" name="type" type="_612" offset="288" context="_435" access="public" location="f0:834" file="f0" line="834"/>
  <Field id="_1263" name="audioset" type="_612" offset="320" context="_435" access="public" location="f0:835" file="f0" line="835"/>
  <Field id="_1264" name="tuner" type="_612" offset="352" context="_435" access="public" location="f0:836" file="f0" line="836"/>
  <Field id="_1265" name="std" type="_376" offset="384" context="_435" access="public" location="f0:837" file="f0" line="837"/>
  <Field id="_1266" name="status" type="_612" offset="448" context="_435" access="public" location="f0:838" file="f0" line="838"/>
  <Field id="_1267" name="capabilities" type="_612" offset="480" context="_435" access="public" location="f0:839" file="f0" line="839"/>
  <Field id="_1268" name="reserved" type="_1593" offset="512" context="_435" access="public" location="f0:840" file="f0" line="840"/>
  <Destructor id="_1269" name="v4l2_input" artificial="1" throw="" context="_435" access="public" mangled="_ZN10v4l2_inputD1Ev *INTERNAL* " demangled="v4l2_input::~v4l2_input()" location="f0:831" file="f0" line="831" endline="831" inline="1">
  </Destructor>
  <OperatorMethod id="_1270" name="=" returns="_1712" artificial="1" throw="" context="_435" access="public" mangled="_ZN10v4l2_inputaSERKS_" demangled="v4l2_input::operator=(v4l2_input const&amp;)" location="f0:831" file="f0" line="831" endline="831" inline="1">
    <Argument type="_1713" location="f0:831" file="f0" line="831"/>
  </OperatorMethod>
  <Constructor id="_1271" name="v4l2_input" artificial="1" throw="" context="_435" access="public" mangled="_ZN10v4l2_inputC1ERKS_ *INTERNAL* " demangled="v4l2_input::v4l2_input(v4l2_input const&amp;)" location="f0:831" file="f0" line="831" endline="831" inline="1">
    <Argument type="_1713" location="f0:831" file="f0" line="831"/>
  </Constructor>
  <Constructor id="_1272" name="v4l2_input" artificial="1" throw="" context="_435" access="public" mangled="_ZN10v4l2_inputC1Ev *INTERNAL* " demangled="v4l2_input::v4l2_input()" location="f0:831" file="f0" line="831" inline="1"/>
  <CvQualifiedType id="_877r" type="_877" restrict="1"/>
  <Field id="_1274" name="id" type="_612" offset="0" context="_469" access="public" location="f0:908" file="f0" line="908"/>
  <Field id="_1275" name="size" type="_612" offset="32" context="_469" access="public" location="f0:909" file="f0" line="909"/>
  <Field id="_1276" name="reserved2" type="_1714" offset="64" context="_469" access="public" location="f0:910" file="f0" line="910"/>
  <Field id="_1277" name="" type="_1278" offset="96" context="_469" access="public" location="f0:915" file="f0" line="915"/>
  <Union id="_1278" context="_469" access="public" mangled="N16v4l2_ext_control3._9E" demangled="v4l2_ext_control::._9" location="f0:911" file="f0" line="911" artificial="1" size="64" align="64" members="_1715 _1716 _1717 " bases=""/>
  <Destructor id="_1279" name="v4l2_ext_control" artificial="1" throw="" context="_469" access="public" mangled="_ZN16v4l2_ext_controlD1Ev *INTERNAL* " demangled="v4l2_ext_control::~v4l2_ext_control()" location="f0:907" file="f0" line="907" endline="907" inline="1">
  </Destructor>
  <OperatorMethod id="_1280" name="=" returns="_1718" artificial="1" throw="" context="_469" access="public" mangled="_ZN16v4l2_ext_controlaSERKS_" demangled="v4l2_ext_control::operator=(v4l2_ext_control const&amp;)" location="f0:907" file="f0" line="907" endline="907" inline="1">
    <Argument type="_1719" location="f0:907" file="f0" line="907"/>
  </OperatorMethod>
  <Constructor id="_1281" name="v4l2_ext_control" artificial="1" throw="" context="_469" access="public" mangled="_ZN16v4l2_ext_controlC1ERKS_ *INTERNAL* " demangled="v4l2_ext_control::v4l2_ext_control(v4l2_ext_control const&amp;)" location="f0:907" file="f0" line="907" endline="907" inline="1">
    <Argument type="_1719" location="f0:907" file="f0" line="907"/>
  </Constructor>
  <Constructor id="_1282" name="v4l2_ext_control" artificial="1" throw="" context="_469" access="public" mangled="_ZN16v4l2_ext_controlC1Ev *INTERNAL* " demangled="v4l2_ext_control::v4l2_ext_control()" location="f0:907" file="f0" line="907" inline="1"/>
  <PointerType id="_1283" type="_312c" size="64" align="64"/>
  <Field id="_1284" name="capability" type="_612" offset="0" context="_476" access="public" location="f0:597" file="f0" line="597"/>
  <Field id="_1285" name="capturemode" type="_612" offset="32" context="_476" access="public" location="f0:598" file="f0" line="598"/>
  <Field id="_1286" name="timeperframe" type="_794" offset="64" context="_476" access="public" location="f0:599" file="f0" line="599"/>
  <Field id="_1287" name="extendedmode" type="_612" offset="128" context="_476" access="public" location="f0:600" file="f0" line="600"/>
  <Field id="_1288" name="readbuffers" type="_612" offset="160" context="_476" access="public" location="f0:601" file="f0" line="601"/>
  <Field id="_1289" name="reserved" type="_1663" offset="192" context="_476" access="public" location="f0:602" file="f0" line="602"/>
  <Destructor id="_1290" name="v4l2_captureparm" artificial="1" throw="" context="_476" access="public" mangled="_ZN16v4l2_captureparmD1Ev *INTERNAL* " demangled="v4l2_captureparm::~v4l2_captureparm()" location="f0:596" file="f0" line="596" endline="596" inline="1">
  </Destructor>
  <OperatorMethod id="_1291" name="=" returns="_1721" artificial="1" throw="" context="_476" access="public" mangled="_ZN16v4l2_captureparmaSERKS_" demangled="v4l2_captureparm::operator=(v4l2_captureparm const&amp;)" location="f0:596" file="f0" line="596" endline="596" inline="1">
    <Argument type="_1722" location="f0:596" file="f0" line="596"/>
  </OperatorMethod>
  <Constructor id="_1292" name="v4l2_captureparm" artificial="1" throw="" context="_476" access="public" mangled="_ZN16v4l2_captureparmC1ERKS_ *INTERNAL* " demangled="v4l2_captureparm::v4l2_captureparm(v4l2_captureparm const&amp;)" location="f0:596" file="f0" line="596" endline="596" inline="1">
    <Argument type="_1722" location="f0:596" file="f0" line="596"/>
  </Constructor>
  <Constructor id="_1293" name="v4l2_captureparm" artificial="1" throw="" context="_476" access="public" mangled="_ZN16v4l2_captureparmC1Ev *INTERNAL* " demangled="v4l2_captureparm::v4l2_captureparm()" location="f0:596" file="f0" line="596" inline="1"/>
  <Field id="_1295" name="index" type="_612" offset="0" context="_499" access="public" location="f0:1310" file="f0" line="1310"/>
  <Field id="_1296" name="name" type="_1573" offset="32" context="_499" access="public" location="f0:1311" file="f0" line="1311"/>
  <Field id="_1297" name="type" type="_188" offset="288" context="_499" access="public" location="f0:1312" file="f0" line="1312"/>
  <Field id="_1298" name="capability" type="_612" offset="320" context="_499" access="public" location="f0:1313" file="f0" line="1313"/>
  <Field id="_1299" name="rangelow" type="_612" offset="352" context="_499" access="public" location="f0:1314" file="f0" line="1314"/>
  <Field id="_1300" name="rangehigh" type="_612" offset="384" context="_499" access="public" location="f0:1315" file="f0" line="1315"/>
  <Field id="_1301" name="rxsubchans" type="_612" offset="416" context="_499" access="public" location="f0:1316" file="f0" line="1316"/>
  <Field id="_1302" name="audmode" type="_612" offset="448" context="_499" access="public" location="f0:1317" file="f0" line="1317"/>
  <Field id="_1303" name="signal" type="_195" offset="480" context="_499" access="public" location="f0:1318" file="f0" line="1318"/>
  <Field id="_1304" name="afc" type="_195" offset="512" context="_499" access="public" location="f0:1319" file="f0" line="1319"/>
  <Field id="_1305" name="reserved" type="_1663" offset="544" context="_499" access="public" location="f0:1320" file="f0" line="1320"/>
  <Destructor id="_1306" name="v4l2_tuner" artificial="1" throw="" context="_499" access="public" mangled="_ZN10v4l2_tunerD1Ev *INTERNAL* " demangled="v4l2_tuner::~v4l2_tuner()" location="f0:1309" file="f0" line="1309" endline="1309" inline="1">
  </Destructor>
  <OperatorMethod id="_1307" name="=" returns="_1723" artificial="1" throw="" context="_499" access="public" mangled="_ZN10v4l2_tuneraSERKS_" demangled="v4l2_tuner::operator=(v4l2_tuner const&amp;)" location="f0:1309" file="f0" line="1309" endline="1309" inline="1">
    <Argument type="_1724" location="f0:1309" file="f0" line="1309"/>
  </OperatorMethod>
  <Constructor id="_1308" name="v4l2_tuner" artificial="1" throw="" context="_499" access="public" mangled="_ZN10v4l2_tunerC1ERKS_ *INTERNAL* " demangled="v4l2_tuner::v4l2_tuner(v4l2_tuner const&amp;)" location="f0:1309" file="f0" line="1309" endline="1309" inline="1">
    <Argument type="_1724" location="f0:1309" file="f0" line="1309"/>
  </Constructor>
  <Constructor id="_1309" name="v4l2_tuner" artificial="1" throw="" context="_499" access="public" mangled="_ZN10v4l2_tunerC1Ev *INTERNAL* " demangled="v4l2_tuner::v4l2_tuner()" location="f0:1309" file="f0" line="1309" inline="1"/>
  <Field id="_1310" name="tuner" type="_612" offset="0" context="_501" access="public" location="f0:1366" file="f0" line="1366"/>
  <Field id="_1311" name="type" type="_188" offset="32" context="_501" access="public" location="f0:1367" file="f0" line="1367"/>
  <Field id="_1312" name="seek_upward" type="_612" offset="64" context="_501" access="public" location="f0:1368" file="f0" line="1368"/>
  <Field id="_1313" name="wrap_around" type="_612" offset="96" context="_501" access="public" location="f0:1369" file="f0" line="1369"/>
  <Field id="_1314" name="reserved" type="_1609" offset="128" context="_501" access="public" location="f0:1370" file="f0" line="1370"/>
  <Destructor id="_1315" name="v4l2_hw_freq_seek" artificial="1" throw="" context="_501" access="public" mangled="_ZN17v4l2_hw_freq_seekD1Ev *INTERNAL* " demangled="v4l2_hw_freq_seek::~v4l2_hw_freq_seek()" location="f0:1365" file="f0" line="1365" endline="1365" inline="1">
  </Destructor>
  <OperatorMethod id="_1316" name="=" returns="_1725" artificial="1" throw="" context="_501" access="public" mangled="_ZN17v4l2_hw_freq_seekaSERKS_" demangled="v4l2_hw_freq_seek::operator=(v4l2_hw_freq_seek const&amp;)" location="f0:1365" file="f0" line="1365" endline="1365" inline="1">
    <Argument type="_1726" location="f0:1365" file="f0" line="1365"/>
  </OperatorMethod>
  <Constructor id="_1317" name="v4l2_hw_freq_seek" artificial="1" throw="" context="_501" access="public" mangled="_ZN17v4l2_hw_freq_seekC1ERKS_ *INTERNAL* " demangled="v4l2_hw_freq_seek::v4l2_hw_freq_seek(v4l2_hw_freq_seek const&amp;)" location="f0:1365" file="f0" line="1365" endline="1365" inline="1">
    <Argument type="_1726" location="f0:1365" file="f0" line="1365"/>
  </Constructor>
  <Constructor id="_1318" name="v4l2_hw_freq_seek" artificial="1" throw="" context="_501" access="public" mangled="_ZN17v4l2_hw_freq_seekC1Ev *INTERNAL* " demangled="v4l2_hw_freq_seek::v4l2_hw_freq_seek()" location="f0:1365" file="f0" line="1365" inline="1"/>
  <Field id="_1319" name="__val" type="_1727" offset="0" context="_502" access="public" location="f9:144" file="f9" line="144"/>
  <Destructor id="_1320" name="._0" artificial="1" throw="" context="_502" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f9:144" file="f9" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_1321" name="=" returns="_1728" artificial="1" throw="" context="_502" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f9:144" file="f9" line="144" endline="144" inline="1">
    <Argument type="_1729" location="f9:144" file="f9" line="144"/>
  </OperatorMethod>
  <Constructor id="_1322" name="._0" artificial="1" throw="" context="_502" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f9:144" file="f9" line="144" endline="144" inline="1">
    <Argument type="_1729" location="f9:144" file="f9" line="144"/>
  </Constructor>
  <Constructor id="_1323" name="._0" artificial="1" throw="" context="_502" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f9:144" file="f9" line="144" inline="1"/>
  <Field id="_1324" name="val" type="_1727" offset="0" context="_503" access="public" location="f7:36" file="f7" line="36"/>
  <Destructor id="_1325" name="._4" artificial="1" throw="" context="_503" access="public" mangled="_ZN15__kernel_fsid_tD1Ev *INTERNAL* " demangled="__kernel_fsid_t::~__kernel_fsid_t()" location="f7:37" file="f7" line="37" endline="37" inline="1">
  </Destructor>
  <OperatorMethod id="_1326" name="=" returns="_1730" artificial="1" throw="" context="_503" access="public" mangled="_ZN15__kernel_fsid_taSERKS_" demangled="__kernel_fsid_t::operator=(__kernel_fsid_t const&amp;)" location="f7:37" file="f7" line="37" endline="37" inline="1">
    <Argument type="_1731" location="f7:35" file="f7" line="35"/>
  </OperatorMethod>
  <Constructor id="_1327" name="._4" artificial="1" throw="" context="_503" access="public" mangled="_ZN15__kernel_fsid_tC1ERKS_ *INTERNAL* " demangled="__kernel_fsid_t::__kernel_fsid_t(__kernel_fsid_t const&amp;)" location="f7:37" file="f7" line="37" endline="37" inline="1">
    <Argument type="_1731" location="f7:35" file="f7" line="35"/>
  </Constructor>
  <Constructor id="_1328" name="._4" artificial="1" throw="" context="_503" access="public" mangled="_ZN15__kernel_fsid_tC1Ev *INTERNAL* " demangled="__kernel_fsid_t::__kernel_fsid_t()" location="f7:37" file="f7" line="37" inline="1"/>
  <Field id="_1329" name="w" type="_26" offset="0" context="_504" access="public" location="f0:584" file="f0" line="584"/>
  <Field id="_1330" name="field" type="_727" offset="128" context="_504" access="public" location="f0:585" file="f0" line="585"/>
  <Field id="_1331" name="chromakey" type="_612" offset="160" context="_504" access="public" location="f0:586" file="f0" line="586"/>
  <Field id="_1332" name="clips" type="_1633" offset="192" context="_504" access="public" location="f0:587" file="f0" line="587"/>
  <Field id="_1333" name="clipcount" type="_612" offset="256" context="_504" access="public" location="f0:588" file="f0" line="588"/>
  <Field id="_1334" name="bitmap" type="_668" offset="320" context="_504" access="public" location="f0:589" file="f0" line="589"/>
  <Field id="_1335" name="global_alpha" type="_566" offset="384" context="_504" access="public" location="f0:590" file="f0" line="590"/>
  <Destructor id="_1336" name="v4l2_window" artificial="1" throw="" context="_504" access="public" mangled="_ZN11v4l2_windowD1Ev *INTERNAL* " demangled="v4l2_window::~v4l2_window()" location="f0:583" file="f0" line="583" endline="583" inline="1">
  </Destructor>
  <OperatorMethod id="_1337" name="=" returns="_1732" artificial="1" throw="" context="_504" access="public" mangled="_ZN11v4l2_windowaSERKS_" demangled="v4l2_window::operator=(v4l2_window const&amp;)" location="f0:583" file="f0" line="583" endline="583" inline="1">
    <Argument type="_1733" location="f0:583" file="f0" line="583"/>
  </OperatorMethod>
  <Constructor id="_1338" name="v4l2_window" artificial="1" throw="" context="_504" access="public" mangled="_ZN11v4l2_windowC1ERKS_ *INTERNAL* " demangled="v4l2_window::v4l2_window(v4l2_window const&amp;)" location="f0:583" file="f0" line="583" endline="583" inline="1">
    <Argument type="_1733" location="f0:583" file="f0" line="583"/>
  </Constructor>
  <Constructor id="_1339" name="v4l2_window" artificial="1" throw="" context="_504" access="public" mangled="_ZN11v4l2_windowC1Ev *INTERNAL* " demangled="v4l2_window::v4l2_window()" location="f0:583" file="f0" line="583" inline="1"/>
  <Field id="_1340" name="id" type="_612" offset="0" context="_507" access="public" location="f0:938" file="f0" line="938"/>
  <Field id="_1341" name="type" type="_408" offset="32" context="_507" access="public" location="f0:939" file="f0" line="939"/>
  <Field id="_1342" name="name" type="_1573" offset="64" context="_507" access="public" location="f0:940" file="f0" line="940"/>
  <Field id="_1343" name="minimum" type="_195" offset="320" context="_507" access="public" location="f0:941" file="f0" line="941"/>
  <Field id="_1344" name="maximum" type="_195" offset="352" context="_507" access="public" location="f0:942" file="f0" line="942"/>
  <Field id="_1345" name="step" type="_195" offset="384" context="_507" access="public" location="f0:943" file="f0" line="943"/>
  <Field id="_1346" name="default_value" type="_195" offset="416" context="_507" access="public" location="f0:944" file="f0" line="944"/>
  <Field id="_1347" name="flags" type="_612" offset="448" context="_507" access="public" location="f0:945" file="f0" line="945"/>
  <Field id="_1348" name="reserved" type="_1596" offset="480" context="_507" access="public" location="f0:946" file="f0" line="946"/>
  <Destructor id="_1349" name="v4l2_queryctrl" artificial="1" throw="" context="_507" access="public" mangled="_ZN14v4l2_queryctrlD1Ev *INTERNAL* " demangled="v4l2_queryctrl::~v4l2_queryctrl()" location="f0:937" file="f0" line="937" endline="937" inline="1">
  </Destructor>
  <OperatorMethod id="_1350" name="=" returns="_1734" artificial="1" throw="" context="_507" access="public" mangled="_ZN14v4l2_queryctrlaSERKS_" demangled="v4l2_queryctrl::operator=(v4l2_queryctrl const&amp;)" location="f0:937" file="f0" line="937" endline="937" inline="1">
    <Argument type="_1735" location="f0:937" file="f0" line="937"/>
  </OperatorMethod>
  <Constructor id="_1351" name="v4l2_queryctrl" artificial="1" throw="" context="_507" access="public" mangled="_ZN14v4l2_queryctrlC1ERKS_ *INTERNAL* " demangled="v4l2_queryctrl::v4l2_queryctrl(v4l2_queryctrl const&amp;)" location="f0:937" file="f0" line="937" endline="937" inline="1">
    <Argument type="_1735" location="f0:937" file="f0" line="937"/>
  </Constructor>
  <Constructor id="_1352" name="v4l2_queryctrl" artificial="1" throw="" context="_507" access="public" mangled="_ZN14v4l2_queryctrlC1Ev *INTERNAL* " demangled="v4l2_queryctrl::v4l2_queryctrl()" location="f0:937" file="f0" line="937" inline="1"/>
  <Field id="_1353" name="_next" type="_1601" offset="0" context="_514" access="public" location="f8:187" file="f8" line="187"/>
  <Field id="_1354" name="_sbuf" type="_877" offset="64" context="_514" access="public" location="f8:188" file="f8" line="188"/>
  <Field id="_1355" name="_pos" type="_45" offset="128" context="_514" access="public" location="f8:192" file="f8" line="192"/>
  <Destructor id="_1356" name="_IO_marker" artificial="1" throw="" context="_514" access="public" mangled="_ZN10_IO_markerD1Ev *INTERNAL* " demangled="_IO_marker::~_IO_marker()" location="f8:186" file="f8" line="186" endline="186" inline="1">
  </Destructor>
  <OperatorMethod id="_1357" name="=" returns="_1736" artificial="1" throw="" context="_514" access="public" mangled="_ZN10_IO_markeraSERKS_" demangled="_IO_marker::operator=(_IO_marker const&amp;)" location="f8:186" file="f8" line="186" endline="186" inline="1">
    <Argument type="_1737" location="f8:186" file="f8" line="186"/>
  </OperatorMethod>
  <Constructor id="_1358" name="_IO_marker" artificial="1" throw="" context="_514" access="public" mangled="_ZN10_IO_markerC1ERKS_ *INTERNAL* " demangled="_IO_marker::_IO_marker(_IO_marker const&amp;)" location="f8:186" file="f8" line="186" endline="186" inline="1">
    <Argument type="_1737" location="f8:186" file="f8" line="186"/>
  </Constructor>
  <Constructor id="_1359" name="_IO_marker" artificial="1" throw="" context="_514" access="public" mangled="_ZN10_IO_markerC1Ev *INTERNAL* " demangled="_IO_marker::_IO_marker()" location="f8:186" file="f8" line="186" inline="1"/>
  <CvQualifiedType id="_1054r" type="_1054" restrict="1"/>
  <Field id="_1361" name="quality" type="_45" offset="0" context="_535" access="public" location="f0:480" file="f0" line="480"/>
  <Field id="_1362" name="APPn" type="_45" offset="32" context="_535" access="public" location="f0:482" file="f0" line="482"/>
  <Field id="_1363" name="APP_len" type="_45" offset="64" context="_535" access="public" location="f0:484" file="f0" line="484"/>
  <Field id="_1364" name="APP_data" type="_1738" offset="96" context="_535" access="public" location="f0:485" file="f0" line="485"/>
  <Field id="_1365" name="COM_len" type="_45" offset="576" context="_535" access="public" location="f0:487" file="f0" line="487"/>
  <Field id="_1366" name="COM_data" type="_1738" offset="608" context="_535" access="public" location="f0:488" file="f0" line="488"/>
  <Field id="_1367" name="jpeg_markers" type="_612" offset="1088" context="_535" access="public" location="f0:490" file="f0" line="490"/>
  <Destructor id="_1368" name="v4l2_jpegcompression" artificial="1" throw="" context="_535" access="public" mangled="_ZN20v4l2_jpegcompressionD1Ev *INTERNAL* " demangled="v4l2_jpegcompression::~v4l2_jpegcompression()" location="f0:479" file="f0" line="479" endline="479" inline="1">
  </Destructor>
  <OperatorMethod id="_1369" name="=" returns="_1739" artificial="1" throw="" context="_535" access="public" mangled="_ZN20v4l2_jpegcompressionaSERKS_" demangled="v4l2_jpegcompression::operator=(v4l2_jpegcompression const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_1740" location="f0:479" file="f0" line="479"/>
  </OperatorMethod>
  <Constructor id="_1370" name="v4l2_jpegcompression" artificial="1" throw="" context="_535" access="public" mangled="_ZN20v4l2_jpegcompressionC1ERKS_ *INTERNAL* " demangled="v4l2_jpegcompression::v4l2_jpegcompression(v4l2_jpegcompression const&amp;)" location="f0:479" file="f0" line="479" endline="479" inline="1">
    <Argument type="_1740" location="f0:479" file="f0" line="479"/>
  </Constructor>
  <Constructor id="_1371" name="v4l2_jpegcompression" artificial="1" throw="" context="_535" access="public" mangled="_ZN20v4l2_jpegcompressionC1Ev *INTERNAL* " demangled="v4l2_jpegcompression::v4l2_jpegcompression()" location="f0:479" file="f0" line="479" inline="1"/>
  <Field id="_1372" name="linemask" type="_1741" offset="0" context="_554" access="public" location="f0:1569" file="f0" line="1569"/>
  <Field id="_1373" name="line" type="_1742" offset="64" context="_554" access="public" location="f0:1570" file="f0" line="1570"/>
  <Destructor id="_1374" name="v4l2_mpeg_vbi_itv0" artificial="1" throw="" context="_554" access="public" mangled="_ZN18v4l2_mpeg_vbi_itv0D1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_itv0::~v4l2_mpeg_vbi_itv0()" location="f0:1568" file="f0" line="1568" endline="1568" inline="1">
  </Destructor>
  <OperatorMethod id="_1375" name="=" returns="_1743" artificial="1" throw="" context="_554" access="public" mangled="_ZN18v4l2_mpeg_vbi_itv0aSERKS_" demangled="v4l2_mpeg_vbi_itv0::operator=(v4l2_mpeg_vbi_itv0 const&amp;)" location="f0:1568" file="f0" line="1568" endline="1568" inline="1">
    <Argument type="_1744" location="f0:1568" file="f0" line="1568"/>
  </OperatorMethod>
  <Constructor id="_1376" name="v4l2_mpeg_vbi_itv0" artificial="1" throw="" context="_554" access="public" mangled="_ZN18v4l2_mpeg_vbi_itv0C1ERKS_ *INTERNAL* " demangled="v4l2_mpeg_vbi_itv0::v4l2_mpeg_vbi_itv0(v4l2_mpeg_vbi_itv0 const&amp;)" location="f0:1568" file="f0" line="1568" endline="1568" inline="1">
    <Argument type="_1744" location="f0:1568" file="f0" line="1568"/>
  </Constructor>
  <Constructor id="_1377" name="v4l2_mpeg_vbi_itv0" artificial="1" throw="" context="_554" access="public" mangled="_ZN18v4l2_mpeg_vbi_itv0C1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_itv0::v4l2_mpeg_vbi_itv0()" location="f0:1568" file="f0" line="1568" inline="1"/>
  <Field id="_1378" name="capability" type="_612" offset="0" context="_561" access="public" location="f0:553" file="f0" line="553"/>
  <Field id="_1379" name="flags" type="_612" offset="32" context="_561" access="public" location="f0:554" file="f0" line="554"/>
  <Field id="_1380" name="base" type="_668" offset="64" context="_561" access="public" location="f0:557" file="f0" line="557"/>
  <Field id="_1381" name="fmt" type="_282" offset="128" context="_561" access="public" location="f0:558" file="f0" line="558"/>
  <Destructor id="_1382" name="v4l2_framebuffer" artificial="1" throw="" context="_561" access="public" mangled="_ZN16v4l2_framebufferD1Ev *INTERNAL* " demangled="v4l2_framebuffer::~v4l2_framebuffer()" location="f0:552" file="f0" line="552" endline="552" inline="1">
  </Destructor>
  <OperatorMethod id="_1383" name="=" returns="_1745" artificial="1" throw="" context="_561" access="public" mangled="_ZN16v4l2_framebufferaSERKS_" demangled="v4l2_framebuffer::operator=(v4l2_framebuffer const&amp;)" location="f0:552" file="f0" line="552" endline="552" inline="1">
    <Argument type="_1746" location="f0:552" file="f0" line="552"/>
  </OperatorMethod>
  <Constructor id="_1384" name="v4l2_framebuffer" artificial="1" throw="" context="_561" access="public" mangled="_ZN16v4l2_framebufferC1ERKS_ *INTERNAL* " demangled="v4l2_framebuffer::v4l2_framebuffer(v4l2_framebuffer const&amp;)" location="f0:552" file="f0" line="552" endline="552" inline="1">
    <Argument type="_1746" location="f0:552" file="f0" line="552"/>
  </Constructor>
  <Constructor id="_1385" name="v4l2_framebuffer" artificial="1" throw="" context="_561" access="public" mangled="_ZN16v4l2_framebufferC1Ev *INTERNAL* " demangled="v4l2_framebuffer::v4l2_framebuffer()" location="f0:552" file="f0" line="552" inline="1"/>
  <PointerType id="_1386" type="_671" size="64" align="64"/>
  <Field id="_1387" name="tz_minuteswest" type="_45" offset="0" context="_582" access="public" location="f12:59" file="f12" line="59"/>
  <Field id="_1388" name="tz_dsttime" type="_45" offset="32" context="_582" access="public" location="f12:60" file="f12" line="60"/>
  <Destructor id="_1389" name="timezone" artificial="1" throw="" context="_582" access="public" mangled="_ZN8timezoneD1Ev *INTERNAL* " demangled="timezone::~timezone()" location="f12:58" file="f12" line="58" endline="58" inline="1">
  </Destructor>
  <OperatorMethod id="_1390" name="=" returns="_1747" artificial="1" throw="" context="_582" access="public" mangled="_ZN8timezoneaSERKS_" demangled="timezone::operator=(timezone const&amp;)" location="f12:58" file="f12" line="58" endline="58" inline="1">
    <Argument type="_1748" location="f12:58" file="f12" line="58"/>
  </OperatorMethod>
  <Constructor id="_1391" name="timezone" artificial="1" throw="" context="_582" access="public" mangled="_ZN8timezoneC1ERKS_ *INTERNAL* " demangled="timezone::timezone(timezone const&amp;)" location="f12:58" file="f12" line="58" endline="58" inline="1">
    <Argument type="_1748" location="f12:58" file="f12" line="58"/>
  </Constructor>
  <Constructor id="_1392" name="timezone" artificial="1" throw="" context="_582" access="public" mangled="_ZN8timezoneC1Ev *INTERNAL* " demangled="timezone::timezone()" location="f12:58" file="f12" line="58" inline="1"/>
  <Field id="_1393" name="index" type="_612" offset="0" context="_606" access="public" location="f0:1324" file="f0" line="1324"/>
  <Field id="_1394" name="name" type="_1573" offset="32" context="_606" access="public" location="f0:1325" file="f0" line="1325"/>
  <Field id="_1395" name="capability" type="_612" offset="288" context="_606" access="public" location="f0:1326" file="f0" line="1326"/>
  <Field id="_1396" name="rangelow" type="_612" offset="320" context="_606" access="public" location="f0:1327" file="f0" line="1327"/>
  <Field id="_1397" name="rangehigh" type="_612" offset="352" context="_606" access="public" location="f0:1328" file="f0" line="1328"/>
  <Field id="_1398" name="txsubchans" type="_612" offset="384" context="_606" access="public" location="f0:1329" file="f0" line="1329"/>
  <Field id="_1399" name="reserved" type="_1663" offset="416" context="_606" access="public" location="f0:1330" file="f0" line="1330"/>
  <Destructor id="_1400" name="v4l2_modulator" artificial="1" throw="" context="_606" access="public" mangled="_ZN14v4l2_modulatorD1Ev *INTERNAL* " demangled="v4l2_modulator::~v4l2_modulator()" location="f0:1323" file="f0" line="1323" endline="1323" inline="1">
  </Destructor>
  <OperatorMethod id="_1401" name="=" returns="_1749" artificial="1" throw="" context="_606" access="public" mangled="_ZN14v4l2_modulatoraSERKS_" demangled="v4l2_modulator::operator=(v4l2_modulator const&amp;)" location="f0:1323" file="f0" line="1323" endline="1323" inline="1">
    <Argument type="_1750" location="f0:1323" file="f0" line="1323"/>
  </OperatorMethod>
  <Constructor id="_1402" name="v4l2_modulator" artificial="1" throw="" context="_606" access="public" mangled="_ZN14v4l2_modulatorC1ERKS_ *INTERNAL* " demangled="v4l2_modulator::v4l2_modulator(v4l2_modulator const&amp;)" location="f0:1323" file="f0" line="1323" endline="1323" inline="1">
    <Argument type="_1750" location="f0:1323" file="f0" line="1323"/>
  </Constructor>
  <Constructor id="_1403" name="v4l2_modulator" artificial="1" throw="" context="_606" access="public" mangled="_ZN14v4l2_modulatorC1Ev *INTERNAL* " demangled="v4l2_modulator::v4l2_modulator()" location="f0:1323" file="f0" line="1323" inline="1"/>
  <Field id="_1404" name="service_set" type="_609" offset="0" context="_610" access="public" location="f0:1499" file="f0" line="1499"/>
  <Field id="_1405" name="service_lines" type="_1592" offset="16" context="_610" access="public" location="f0:1504" file="f0" line="1504"/>
  <Field id="_1406" name="io_size" type="_612" offset="800" context="_610" access="public" location="f0:1505" file="f0" line="1505"/>
  <Field id="_1407" name="reserved" type="_1596" offset="832" context="_610" access="public" location="f0:1506" file="f0" line="1506"/>
  <Destructor id="_1408" name="v4l2_sliced_vbi_format" artificial="1" throw="" context="_610" access="public" mangled="_ZN22v4l2_sliced_vbi_formatD1Ev *INTERNAL* " demangled="v4l2_sliced_vbi_format::~v4l2_sliced_vbi_format()" location="f0:1498" file="f0" line="1498" endline="1498" inline="1">
  </Destructor>
  <OperatorMethod id="_1409" name="=" returns="_1751" artificial="1" throw="" context="_610" access="public" mangled="_ZN22v4l2_sliced_vbi_formataSERKS_" demangled="v4l2_sliced_vbi_format::operator=(v4l2_sliced_vbi_format const&amp;)" location="f0:1498" file="f0" line="1498" endline="1498" inline="1">
    <Argument type="_1752" location="f0:1498" file="f0" line="1498"/>
  </OperatorMethod>
  <Constructor id="_1410" name="v4l2_sliced_vbi_format" artificial="1" throw="" context="_610" access="public" mangled="_ZN22v4l2_sliced_vbi_formatC1ERKS_ *INTERNAL* " demangled="v4l2_sliced_vbi_format::v4l2_sliced_vbi_format(v4l2_sliced_vbi_format const&amp;)" location="f0:1498" file="f0" line="1498" endline="1498" inline="1">
    <Argument type="_1752" location="f0:1498" file="f0" line="1498"/>
  </Constructor>
  <Constructor id="_1411" name="v4l2_sliced_vbi_format" artificial="1" throw="" context="_610" access="public" mangled="_ZN22v4l2_sliced_vbi_formatC1Ev *INTERNAL* " demangled="v4l2_sliced_vbi_format::v4l2_sliced_vbi_format()" location="f0:1498" file="f0" line="1498" inline="1"/>
  <Field id="_1412" name="it_interval" type="_10" offset="0" context="_618" access="public" location="f12:112" file="f12" line="112"/>
  <Field id="_1413" name="it_value" type="_10" offset="128" context="_618" access="public" location="f12:114" file="f12" line="114"/>
  <Destructor id="_1414" name="itimerval" artificial="1" throw="" context="_618" access="public" mangled="_ZN9itimervalD1Ev *INTERNAL* " demangled="itimerval::~itimerval()" location="f12:110" file="f12" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_1415" name="=" returns="_1753" artificial="1" throw="" context="_618" access="public" mangled="_ZN9itimervalaSERKS_" demangled="itimerval::operator=(itimerval const&amp;)" location="f12:110" file="f12" line="110" endline="110" inline="1">
    <Argument type="_1754" location="f12:110" file="f12" line="110"/>
  </OperatorMethod>
  <Constructor id="_1416" name="itimerval" artificial="1" throw="" context="_618" access="public" mangled="_ZN9itimervalC1ERKS_ *INTERNAL* " demangled="itimerval::itimerval(itimerval const&amp;)" location="f12:110" file="f12" line="110" endline="110" inline="1">
    <Argument type="_1754" location="f12:110" file="f12" line="110"/>
  </Constructor>
  <Constructor id="_1417" name="itimerval" artificial="1" throw="" context="_618" access="public" mangled="_ZN9itimervalC1Ev *INTERNAL* " demangled="itimerval::itimerval()" location="f12:110" file="f12" line="110" inline="1"/>
  <PointerType id="_1418" type="_47" size="64" align="64"/>
  <Field id="_1419" name="min" type="_794" offset="0" context="_642" access="public" location="f0:430" file="f0" line="430"/>
  <Field id="_1420" name="max" type="_794" offset="64" context="_642" access="public" location="f0:431" file="f0" line="431"/>
  <Field id="_1421" name="step" type="_794" offset="128" context="_642" access="public" location="f0:432" file="f0" line="432"/>
  <Destructor id="_1422" name="v4l2_frmival_stepwise" artificial="1" throw="" context="_642" access="public" mangled="_ZN21v4l2_frmival_stepwiseD1Ev *INTERNAL* " demangled="v4l2_frmival_stepwise::~v4l2_frmival_stepwise()" location="f0:429" file="f0" line="429" endline="429" inline="1">
  </Destructor>
  <OperatorMethod id="_1423" name="=" returns="_1755" artificial="1" throw="" context="_642" access="public" mangled="_ZN21v4l2_frmival_stepwiseaSERKS_" demangled="v4l2_frmival_stepwise::operator=(v4l2_frmival_stepwise const&amp;)" location="f0:429" file="f0" line="429" endline="429" inline="1">
    <Argument type="_1756" location="f0:429" file="f0" line="429"/>
  </OperatorMethod>
  <Constructor id="_1424" name="v4l2_frmival_stepwise" artificial="1" throw="" context="_642" access="public" mangled="_ZN21v4l2_frmival_stepwiseC1ERKS_ *INTERNAL* " demangled="v4l2_frmival_stepwise::v4l2_frmival_stepwise(v4l2_frmival_stepwise const&amp;)" location="f0:429" file="f0" line="429" endline="429" inline="1">
    <Argument type="_1756" location="f0:429" file="f0" line="429"/>
  </Constructor>
  <Constructor id="_1425" name="v4l2_frmival_stepwise" artificial="1" throw="" context="_642" access="public" mangled="_ZN21v4l2_frmival_stepwiseC1Ev *INTERNAL* " demangled="v4l2_frmival_stepwise::v4l2_frmival_stepwise()" location="f0:429" file="f0" line="429" inline="1"/>
  <Field id="_1426" name="id" type="_566" offset="0" context="_650" access="public" location="f0:1564" file="f0" line="1564"/>
  <Field id="_1427" name="data" type="_1757" offset="8" context="_650" access="public" location="f0:1565" file="f0" line="1565"/>
  <Destructor id="_1428" name="v4l2_mpeg_vbi_itv0_line" artificial="1" throw="" context="_650" access="public" mangled="_ZN23v4l2_mpeg_vbi_itv0_lineD1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_itv0_line::~v4l2_mpeg_vbi_itv0_line()" location="f0:1563" file="f0" line="1563" endline="1563" inline="1">
  </Destructor>
  <OperatorMethod id="_1429" name="=" returns="_1758" artificial="1" throw="" context="_650" access="public" mangled="_ZN23v4l2_mpeg_vbi_itv0_lineaSERKS_" demangled="v4l2_mpeg_vbi_itv0_line::operator=(v4l2_mpeg_vbi_itv0_line const&amp;)" location="f0:1563" file="f0" line="1563" endline="1563" inline="1">
    <Argument type="_1759" location="f0:1563" file="f0" line="1563"/>
  </OperatorMethod>
  <Constructor id="_1430" name="v4l2_mpeg_vbi_itv0_line" artificial="1" throw="" context="_650" access="public" mangled="_ZN23v4l2_mpeg_vbi_itv0_lineC1ERKS_ *INTERNAL* " demangled="v4l2_mpeg_vbi_itv0_line::v4l2_mpeg_vbi_itv0_line(v4l2_mpeg_vbi_itv0_line const&amp;)" location="f0:1563" file="f0" line="1563" endline="1563" inline="1">
    <Argument type="_1759" location="f0:1563" file="f0" line="1563"/>
  </Constructor>
  <Constructor id="_1431" name="v4l2_mpeg_vbi_itv0_line" artificial="1" throw="" context="_650" access="public" mangled="_ZN23v4l2_mpeg_vbi_itv0_lineC1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_itv0_line::v4l2_mpeg_vbi_itv0_line()" location="f0:1563" file="f0" line="1563" inline="1"/>
  <Field id="_1432" name="index" type="_612" offset="0" context="_676" access="public" location="f0:371" file="f0" line="371"/>
  <Field id="_1433" name="type" type="_592" offset="32" context="_676" access="public" location="f0:372" file="f0" line="372"/>
  <Field id="_1434" name="flags" type="_612" offset="64" context="_676" access="public" location="f0:373" file="f0" line="373"/>
  <Field id="_1435" name="description" type="_1573" offset="96" context="_676" access="public" location="f0:374" file="f0" line="374"/>
  <Field id="_1436" name="pixelformat" type="_612" offset="352" context="_676" access="public" location="f0:375" file="f0" line="375"/>
  <Field id="_1437" name="reserved" type="_1663" offset="384" context="_676" access="public" location="f0:376" file="f0" line="376"/>
  <Destructor id="_1438" name="v4l2_fmtdesc" artificial="1" throw="" context="_676" access="public" mangled="_ZN12v4l2_fmtdescD1Ev *INTERNAL* " demangled="v4l2_fmtdesc::~v4l2_fmtdesc()" location="f0:370" file="f0" line="370" endline="370" inline="1">
  </Destructor>
  <OperatorMethod id="_1439" name="=" returns="_1760" artificial="1" throw="" context="_676" access="public" mangled="_ZN12v4l2_fmtdescaSERKS_" demangled="v4l2_fmtdesc::operator=(v4l2_fmtdesc const&amp;)" location="f0:370" file="f0" line="370" endline="370" inline="1">
    <Argument type="_1761" location="f0:370" file="f0" line="370"/>
  </OperatorMethod>
  <Constructor id="_1440" name="v4l2_fmtdesc" artificial="1" throw="" context="_676" access="public" mangled="_ZN12v4l2_fmtdescC1ERKS_ *INTERNAL* " demangled="v4l2_fmtdesc::v4l2_fmtdesc(v4l2_fmtdesc const&amp;)" location="f0:370" file="f0" line="370" endline="370" inline="1">
    <Argument type="_1761" location="f0:370" file="f0" line="370"/>
  </Constructor>
  <Constructor id="_1441" name="v4l2_fmtdesc" artificial="1" throw="" context="_676" access="public" mangled="_ZN12v4l2_fmtdescC1Ev *INTERNAL* " demangled="v4l2_fmtdesc::v4l2_fmtdesc()" location="f0:370" file="f0" line="370" inline="1"/>
  <Field id="_1442" name="width" type="_612" offset="0" context="_677" access="public" location="f0:394" file="f0" line="394"/>
  <Field id="_1443" name="height" type="_612" offset="32" context="_677" access="public" location="f0:395" file="f0" line="395"/>
  <Destructor id="_1444" name="v4l2_frmsize_discrete" artificial="1" throw="" context="_677" access="public" mangled="_ZN21v4l2_frmsize_discreteD1Ev *INTERNAL* " demangled="v4l2_frmsize_discrete::~v4l2_frmsize_discrete()" location="f0:393" file="f0" line="393" endline="393" inline="1">
  </Destructor>
  <OperatorMethod id="_1445" name="=" returns="_1762" artificial="1" throw="" context="_677" access="public" mangled="_ZN21v4l2_frmsize_discreteaSERKS_" demangled="v4l2_frmsize_discrete::operator=(v4l2_frmsize_discrete const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_1763" location="f0:393" file="f0" line="393"/>
  </OperatorMethod>
  <Constructor id="_1446" name="v4l2_frmsize_discrete" artificial="1" throw="" context="_677" access="public" mangled="_ZN21v4l2_frmsize_discreteC1ERKS_ *INTERNAL* " demangled="v4l2_frmsize_discrete::v4l2_frmsize_discrete(v4l2_frmsize_discrete const&amp;)" location="f0:393" file="f0" line="393" endline="393" inline="1">
    <Argument type="_1763" location="f0:393" file="f0" line="393"/>
  </Constructor>
  <Constructor id="_1447" name="v4l2_frmsize_discrete" artificial="1" throw="" context="_677" access="public" mangled="_ZN21v4l2_frmsize_discreteC1Ev *INTERNAL* " demangled="v4l2_frmsize_discrete::v4l2_frmsize_discrete()" location="f0:393" file="f0" line="393" inline="1"/>
  <Field id="_1448" name="left" type="_45" offset="0" context="_682" access="public" location="f6:124" file="f6" line="124"/>
  <Field id="_1449" name="top" type="_45" offset="32" context="_682" access="public" location="f6:125" file="f6" line="125"/>
  <Field id="_1450" name="width" type="_45" offset="64" context="_682" access="public" location="f6:126" file="f6" line="126"/>
  <Field id="_1451" name="height" type="_45" offset="96" context="_682" access="public" location="f6:127" file="f6" line="127"/>
  <Destructor id="_1452" name="._24" artificial="1" throw="" context="_682" access="public" mangled="_ZN7fg_rectD1Ev *INTERNAL* " demangled="fg_rect::~fg_rect()" location="f6:129" file="f6" line="129" endline="129" inline="1">
  </Destructor>
  <OperatorMethod id="_1453" name="=" returns="_1764" artificial="1" throw="" context="_682" access="public" mangled="_ZN7fg_rectaSERKS_" demangled="fg_rect::operator=(fg_rect const&amp;)" location="f6:129" file="f6" line="129" endline="129" inline="1">
    <Argument type="_1765" location="f6:123" file="f6" line="123"/>
  </OperatorMethod>
  <Constructor id="_1454" name="._24" artificial="1" throw="" context="_682" access="public" mangled="_ZN7fg_rectC1ERKS_ *INTERNAL* " demangled="fg_rect::fg_rect(fg_rect const&amp;)" location="f6:129" file="f6" line="129" endline="129" inline="1">
    <Argument type="_1765" location="f6:123" file="f6" line="123"/>
  </Constructor>
  <Constructor id="_1455" name="._24" artificial="1" throw="" context="_682" access="public" mangled="_ZN7fg_rectC1Ev *INTERNAL* " demangled="fg_rect::fg_rect()" location="f6:129" file="f6" line="129" inline="1"/>
  <Field id="_1456" name="id" type="_612" offset="0" context="_694" access="public" location="f0:1534" file="f0" line="1534"/>
  <Field id="_1457" name="field" type="_612" offset="32" context="_694" access="public" location="f0:1535" file="f0" line="1535"/>
  <Field id="_1458" name="line" type="_612" offset="64" context="_694" access="public" location="f0:1536" file="f0" line="1536"/>
  <Field id="_1459" name="reserved" type="_612" offset="96" context="_694" access="public" location="f0:1537" file="f0" line="1537"/>
  <Field id="_1460" name="data" type="_1766" offset="128" context="_694" access="public" location="f0:1538" file="f0" line="1538"/>
  <Destructor id="_1461" name="v4l2_sliced_vbi_data" artificial="1" throw="" context="_694" access="public" mangled="_ZN20v4l2_sliced_vbi_dataD1Ev *INTERNAL* " demangled="v4l2_sliced_vbi_data::~v4l2_sliced_vbi_data()" location="f0:1533" file="f0" line="1533" endline="1533" inline="1">
  </Destructor>
  <OperatorMethod id="_1462" name="=" returns="_1767" artificial="1" throw="" context="_694" access="public" mangled="_ZN20v4l2_sliced_vbi_dataaSERKS_" demangled="v4l2_sliced_vbi_data::operator=(v4l2_sliced_vbi_data const&amp;)" location="f0:1533" file="f0" line="1533" endline="1533" inline="1">
    <Argument type="_1768" location="f0:1533" file="f0" line="1533"/>
  </OperatorMethod>
  <Constructor id="_1463" name="v4l2_sliced_vbi_data" artificial="1" throw="" context="_694" access="public" mangled="_ZN20v4l2_sliced_vbi_dataC1ERKS_ *INTERNAL* " demangled="v4l2_sliced_vbi_data::v4l2_sliced_vbi_data(v4l2_sliced_vbi_data const&amp;)" location="f0:1533" file="f0" line="1533" endline="1533" inline="1">
    <Argument type="_1768" location="f0:1533" file="f0" line="1533"/>
  </Constructor>
  <Constructor id="_1464" name="v4l2_sliced_vbi_data" artificial="1" throw="" context="_694" access="public" mangled="_ZN20v4l2_sliced_vbi_dataC1Ev *INTERNAL* " demangled="v4l2_sliced_vbi_data::v4l2_sliced_vbi_data()" location="f0:1533" file="f0" line="1533" inline="1"/>
  <Field id="_1465" name="index" type="_612" offset="0" context="_701" access="public" location="f0:408" file="f0" line="408"/>
  <Field id="_1466" name="pixel_format" type="_612" offset="32" context="_701" access="public" location="f0:409" file="f0" line="409"/>
  <Field id="_1467" name="type" type="_612" offset="64" context="_701" access="public" location="f0:410" file="f0" line="410"/>
  <Field id="_1468" name="" type="_1470" offset="96" context="_701" access="public" location="f0:415" file="f0" line="415"/>
  <Field id="_1469" name="reserved" type="_1596" offset="288" context="_701" access="public" location="f0:417" file="f0" line="417"/>
  <Union id="_1470" context="_701" access="public" mangled="N16v4l2_frmsizeenum3._5E" demangled="v4l2_frmsizeenum::._5" location="f0:412" file="f0" line="412" artificial="1" size="192" align="32" members="_1769 _1770 " bases=""/>
  <Destructor id="_1471" name="v4l2_frmsizeenum" artificial="1" throw="" context="_701" access="public" mangled="_ZN16v4l2_frmsizeenumD1Ev *INTERNAL* " demangled="v4l2_frmsizeenum::~v4l2_frmsizeenum()" location="f0:407" file="f0" line="407" endline="407" inline="1">
  </Destructor>
  <OperatorMethod id="_1472" name="=" returns="_1771" artificial="1" throw="" context="_701" access="public" mangled="_ZN16v4l2_frmsizeenumaSERKS_" demangled="v4l2_frmsizeenum::operator=(v4l2_frmsizeenum const&amp;)" location="f0:407" file="f0" line="407" endline="407" inline="1">
    <Argument type="_1772" location="f0:407" file="f0" line="407"/>
  </OperatorMethod>
  <Constructor id="_1473" name="v4l2_frmsizeenum" artificial="1" throw="" context="_701" access="public" mangled="_ZN16v4l2_frmsizeenumC1ERKS_ *INTERNAL* " demangled="v4l2_frmsizeenum::v4l2_frmsizeenum(v4l2_frmsizeenum const&amp;)" location="f0:407" file="f0" line="407" endline="407" inline="1">
    <Argument type="_1772" location="f0:407" file="f0" line="407"/>
  </Constructor>
  <Constructor id="_1474" name="v4l2_frmsizeenum" artificial="1" throw="" context="_701" access="public" mangled="_ZN16v4l2_frmsizeenumC1Ev *INTERNAL* " demangled="v4l2_frmsizeenum::v4l2_frmsizeenum()" location="f0:407" file="f0" line="407" inline="1"/>
  <Field id="_1475" name="magic" type="_1773" offset="0" context="_714" access="public" location="f0:1581" file="f0" line="1581"/>
  <Field id="_1476" name="" type="_1477" offset="32" context="_714" access="public" location="f0:1585" file="f0" line="1585"/>
  <Union id="_1477" context="_714" access="public" mangled="N22v4l2_mpeg_vbi_fmt_ivtv4._12E" demangled="v4l2_mpeg_vbi_fmt_ivtv::._12" location="f0:1582" file="f0" line="1582" artificial="1" size="12384" align="8" members="_1774 _1775 " bases=""/>
  <Destructor id="_1478" name="v4l2_mpeg_vbi_fmt_ivtv" artificial="1" throw="" context="_714" access="public" mangled="_ZN22v4l2_mpeg_vbi_fmt_ivtvD1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_fmt_ivtv::~v4l2_mpeg_vbi_fmt_ivtv()" location="f0:1580" file="f0" line="1580" endline="1580" inline="1">
  </Destructor>
  <OperatorMethod id="_1479" name="=" returns="_1776" artificial="1" throw="" context="_714" access="public" mangled="_ZN22v4l2_mpeg_vbi_fmt_ivtvaSERKS_" demangled="v4l2_mpeg_vbi_fmt_ivtv::operator=(v4l2_mpeg_vbi_fmt_ivtv const&amp;)" location="f0:1580" file="f0" line="1580" endline="1580" inline="1">
    <Argument type="_1777" location="f0:1580" file="f0" line="1580"/>
  </OperatorMethod>
  <Constructor id="_1480" name="v4l2_mpeg_vbi_fmt_ivtv" artificial="1" throw="" context="_714" access="public" mangled="_ZN22v4l2_mpeg_vbi_fmt_ivtvC1ERKS_ *INTERNAL* " demangled="v4l2_mpeg_vbi_fmt_ivtv::v4l2_mpeg_vbi_fmt_ivtv(v4l2_mpeg_vbi_fmt_ivtv const&amp;)" location="f0:1580" file="f0" line="1580" endline="1580" inline="1">
    <Argument type="_1777" location="f0:1580" file="f0" line="1580"/>
  </Constructor>
  <Constructor id="_1481" name="v4l2_mpeg_vbi_fmt_ivtv" artificial="1" throw="" context="_714" access="public" mangled="_ZN22v4l2_mpeg_vbi_fmt_ivtvC1Ev *INTERNAL* " demangled="v4l2_mpeg_vbi_fmt_ivtv::v4l2_mpeg_vbi_fmt_ivtv()" location="f0:1580" file="f0" line="1580" inline="1"/>
  <Field id="_1482" name="count" type="_612" offset="0" context="_716" access="public" location="f0:512" file="f0" line="512"/>
  <Field id="_1483" name="type" type="_592" offset="32" context="_716" access="public" location="f0:513" file="f0" line="513"/>
  <Field id="_1484" name="memory" type="_495" offset="64" context="_716" access="public" location="f0:514" file="f0" line="514"/>
  <Field id="_1485" name="reserved" type="_1596" offset="96" context="_716" access="public" location="f0:515" file="f0" line="515"/>
  <Destructor id="_1486" name="v4l2_requestbuffers" artificial="1" throw="" context="_716" access="public" mangled="_ZN19v4l2_requestbuffersD1Ev *INTERNAL* " demangled="v4l2_requestbuffers::~v4l2_requestbuffers()" location="f0:511" file="f0" line="511" endline="511" inline="1">
  </Destructor>
  <OperatorMethod id="_1487" name="=" returns="_1778" artificial="1" throw="" context="_716" access="public" mangled="_ZN19v4l2_requestbuffersaSERKS_" demangled="v4l2_requestbuffers::operator=(v4l2_requestbuffers const&amp;)" location="f0:511" file="f0" line="511" endline="511" inline="1">
    <Argument type="_1779" location="f0:511" file="f0" line="511"/>
  </OperatorMethod>
  <Constructor id="_1488" name="v4l2_requestbuffers" artificial="1" throw="" context="_716" access="public" mangled="_ZN19v4l2_requestbuffersC1ERKS_ *INTERNAL* " demangled="v4l2_requestbuffers::v4l2_requestbuffers(v4l2_requestbuffers const&amp;)" location="f0:511" file="f0" line="511" endline="511" inline="1">
    <Argument type="_1779" location="f0:511" file="f0" line="511"/>
  </Constructor>
  <Constructor id="_1489" name="v4l2_requestbuffers" artificial="1" throw="" context="_716" access="public" mangled="_ZN19v4l2_requestbuffersC1Ev *INTERNAL* " demangled="v4l2_requestbuffers::v4l2_requestbuffers()" location="f0:511" file="f0" line="511" inline="1"/>
  <CvQualifiedType id="_1055r" type="_1055" restrict="1"/>
  <CvQualifiedType id="_745r" type="_745" restrict="1"/>
  <Field id="_1492" name="type" type="_612" offset="0" context="_751" access="public" location="f0:455" file="f0" line="455"/>
  <Field id="_1493" name="flags" type="_612" offset="32" context="_751" access="public" location="f0:456" file="f0" line="456"/>
  <Field id="_1494" name="frames" type="_566" offset="64" context="_751" access="public" location="f0:457" file="f0" line="457"/>
  <Field id="_1495" name="seconds" type="_566" offset="72" context="_751" access="public" location="f0:458" file="f0" line="458"/>
  <Field id="_1496" name="minutes" type="_566" offset="80" context="_751" access="public" location="f0:459" file="f0" line="459"/>
  <Field id="_1497" name="hours" type="_566" offset="88" context="_751" access="public" location="f0:460" file="f0" line="460"/>
  <Field id="_1498" name="userbits" type="_1773" offset="96" context="_751" access="public" location="f0:461" file="f0" line="461"/>
  <Destructor id="_1499" name="v4l2_timecode" artificial="1" throw="" context="_751" access="public" mangled="_ZN13v4l2_timecodeD1Ev *INTERNAL* " demangled="v4l2_timecode::~v4l2_timecode()" location="f0:454" file="f0" line="454" endline="454" inline="1">
  </Destructor>
  <OperatorMethod id="_1500" name="=" returns="_1780" artificial="1" throw="" context="_751" access="public" mangled="_ZN13v4l2_timecodeaSERKS_" demangled="v4l2_timecode::operator=(v4l2_timecode const&amp;)" location="f0:454" file="f0" line="454" endline="454" inline="1">
    <Argument type="_1781" location="f0:454" file="f0" line="454"/>
  </OperatorMethod>
  <Constructor id="_1501" name="v4l2_timecode" artificial="1" throw="" context="_751" access="public" mangled="_ZN13v4l2_timecodeC1ERKS_ *INTERNAL* " demangled="v4l2_timecode::v4l2_timecode(v4l2_timecode const&amp;)" location="f0:454" file="f0" line="454" endline="454" inline="1">
    <Argument type="_1781" location="f0:454" file="f0" line="454"/>
  </Constructor>
  <Constructor id="_1502" name="v4l2_timecode" artificial="1" throw="" context="_751" access="public" mangled="_ZN13v4l2_timecodeC1Ev *INTERNAL* " demangled="v4l2_timecode::v4l2_timecode()" location="f0:454" file="f0" line="454" inline="1"/>
  <Field id="_1503" name="entries" type="_612" offset="0" context="_760" access="public" location="f0:1441" file="f0" line="1441"/>
  <Field id="_1504" name="entries_cap" type="_612" offset="32" context="_760" access="public" location="f0:1442" file="f0" line="1442"/>
  <Field id="_1505" name="reserved" type="_1663" offset="64" context="_760" access="public" location="f0:1443" file="f0" line="1443"/>
  <Field id="_1506" name="entry" type="_1782" offset="192" context="_760" access="public" location="f0:1444" file="f0" line="1444"/>
  <Destructor id="_1507" name="v4l2_enc_idx" artificial="1" throw="" context="_760" access="public" mangled="_ZN12v4l2_enc_idxD1Ev *INTERNAL* " demangled="v4l2_enc_idx::~v4l2_enc_idx()" location="f0:1440" file="f0" line="1440" endline="1440" inline="1">
  </Destructor>
  <OperatorMethod id="_1508" name="=" returns="_1783" artificial="1" throw="" context="_760" access="public" mangled="_ZN12v4l2_enc_idxaSERKS_" demangled="v4l2_enc_idx::operator=(v4l2_enc_idx const&amp;)" location="f0:1440" file="f0" line="1440" endline="1440" inline="1">
    <Argument type="_1784" location="f0:1440" file="f0" line="1440"/>
  </OperatorMethod>
  <Constructor id="_1509" name="v4l2_enc_idx" artificial="1" throw="" context="_760" access="public" mangled="_ZN12v4l2_enc_idxC1ERKS_ *INTERNAL* " demangled="v4l2_enc_idx::v4l2_enc_idx(v4l2_enc_idx const&amp;)" location="f0:1440" file="f0" line="1440" endline="1440" inline="1">
    <Argument type="_1784" location="f0:1440" file="f0" line="1440"/>
  </Constructor>
  <Constructor id="_1510" name="v4l2_enc_idx" artificial="1" throw="" context="_760" access="public" mangled="_ZN12v4l2_enc_idxC1Ev *INTERNAL* " demangled="v4l2_enc_idx::v4l2_enc_idx()" location="f0:1440" file="f0" line="1440" inline="1"/>
  <Field id="_1511" name="capability" type="_612" offset="0" context="_761" access="public" location="f0:610" file="f0" line="610"/>
  <Field id="_1512" name="outputmode" type="_612" offset="32" context="_761" access="public" location="f0:611" file="f0" line="611"/>
  <Field id="_1513" name="timeperframe" type="_794" offset="64" context="_761" access="public" location="f0:612" file="f0" line="612"/>
  <Field id="_1514" name="extendedmode" type="_612" offset="128" context="_761" access="public" location="f0:613" file="f0" line="613"/>
  <Field id="_1515" name="writebuffers" type="_612" offset="160" context="_761" access="public" location="f0:614" file="f0" line="614"/>
  <Field id="_1516" name="reserved" type="_1663" offset="192" context="_761" access="public" location="f0:615" file="f0" line="615"/>
  <Destructor id="_1517" name="v4l2_outputparm" artificial="1" throw="" context="_761" access="public" mangled="_ZN15v4l2_outputparmD1Ev *INTERNAL* " demangled="v4l2_outputparm::~v4l2_outputparm()" location="f0:609" file="f0" line="609" endline="609" inline="1">
  </Destructor>
  <OperatorMethod id="_1518" name="=" returns="_1785" artificial="1" throw="" context="_761" access="public" mangled="_ZN15v4l2_outputparmaSERKS_" demangled="v4l2_outputparm::operator=(v4l2_outputparm const&amp;)" location="f0:609" file="f0" line="609" endline="609" inline="1">
    <Argument type="_1786" location="f0:609" file="f0" line="609"/>
  </OperatorMethod>
  <Constructor id="_1519" name="v4l2_outputparm" artificial="1" throw="" context="_761" access="public" mangled="_ZN15v4l2_outputparmC1ERKS_ *INTERNAL* " demangled="v4l2_outputparm::v4l2_outputparm(v4l2_outputparm const&amp;)" location="f0:609" file="f0" line="609" endline="609" inline="1">
    <Argument type="_1786" location="f0:609" file="f0" line="609"/>
  </Constructor>
  <Constructor id="_1520" name="v4l2_outputparm" artificial="1" throw="" context="_761" access="public" mangled="_ZN15v4l2_outputparmC1Ev *INTERNAL* " demangled="v4l2_outputparm::v4l2_outputparm()" location="f0:609" file="f0" line="609" inline="1"/>
  <Field id="_1521" name="offset" type="_624" offset="0" context="_769" access="public" location="f0:1432" file="f0" line="1432"/>
  <Field id="_1522" name="pts" type="_624" offset="64" context="_769" access="public" location="f0:1433" file="f0" line="1433"/>
  <Field id="_1523" name="length" type="_612" offset="128" context="_769" access="public" location="f0:1434" file="f0" line="1434"/>
  <Field id="_1524" name="flags" type="_612" offset="160" context="_769" access="public" location="f0:1435" file="f0" line="1435"/>
  <Field id="_1525" name="reserved" type="_1596" offset="192" context="_769" access="public" location="f0:1436" file="f0" line="1436"/>
  <Destructor id="_1526" name="v4l2_enc_idx_entry" artificial="1" throw="" context="_769" access="public" mangled="_ZN18v4l2_enc_idx_entryD1Ev *INTERNAL* " demangled="v4l2_enc_idx_entry::~v4l2_enc_idx_entry()" location="f0:1431" file="f0" line="1431" endline="1431" inline="1">
  </Destructor>
  <OperatorMethod id="_1527" name="=" returns="_1787" artificial="1" throw="" context="_769" access="public" mangled="_ZN18v4l2_enc_idx_entryaSERKS_" demangled="v4l2_enc_idx_entry::operator=(v4l2_enc_idx_entry const&amp;)" location="f0:1431" file="f0" line="1431" endline="1431" inline="1">
    <Argument type="_1788" location="f0:1431" file="f0" line="1431"/>
  </OperatorMethod>
  <Constructor id="_1528" name="v4l2_enc_idx_entry" artificial="1" throw="" context="_769" access="public" mangled="_ZN18v4l2_enc_idx_entryC1ERKS_ *INTERNAL* " demangled="v4l2_enc_idx_entry::v4l2_enc_idx_entry(v4l2_enc_idx_entry const&amp;)" location="f0:1431" file="f0" line="1431" endline="1431" inline="1">
    <Argument type="_1788" location="f0:1431" file="f0" line="1431"/>
  </Constructor>
  <Constructor id="_1529" name="v4l2_enc_idx_entry" artificial="1" throw="" context="_769" access="public" mangled="_ZN18v4l2_enc_idx_entryC1Ev *INTERNAL* " demangled="v4l2_enc_idx_entry::v4l2_enc_idx_entry()" location="f0:1431" file="f0" line="1431" inline="1"/>
  <Field id="_1530" name="index" type="_612" offset="0" context="_778" access="public" location="f0:727" file="f0" line="727"/>
  <Field id="_1531" name="id" type="_376" offset="64" context="_778" access="public" location="f0:728" file="f0" line="728"/>
  <Field id="_1532" name="name" type="_1789" offset="128" context="_778" access="public" location="f0:729" file="f0" line="729"/>
  <Field id="_1533" name="frameperiod" type="_794" offset="320" context="_778" access="public" location="f0:730" file="f0" line="730"/>
  <Field id="_1534" name="framelines" type="_612" offset="384" context="_778" access="public" location="f0:731" file="f0" line="731"/>
  <Field id="_1535" name="reserved" type="_1663" offset="416" context="_778" access="public" location="f0:732" file="f0" line="732"/>
  <Destructor id="_1536" name="v4l2_standard" artificial="1" throw="" context="_778" access="public" mangled="_ZN13v4l2_standardD1Ev *INTERNAL* " demangled="v4l2_standard::~v4l2_standard()" location="f0:726" file="f0" line="726" endline="726" inline="1">
  </Destructor>
  <OperatorMethod id="_1537" name="=" returns="_1790" artificial="1" throw="" context="_778" access="public" mangled="_ZN13v4l2_standardaSERKS_" demangled="v4l2_standard::operator=(v4l2_standard const&amp;)" location="f0:726" file="f0" line="726" endline="726" inline="1">
    <Argument type="_1791" location="f0:726" file="f0" line="726"/>
  </OperatorMethod>
  <Constructor id="_1538" name="v4l2_standard" artificial="1" throw="" context="_778" access="public" mangled="_ZN13v4l2_standardC1ERKS_ *INTERNAL* " demangled="v4l2_standard::v4l2_standard(v4l2_standard const&amp;)" location="f0:726" file="f0" line="726" endline="726" inline="1">
    <Argument type="_1791" location="f0:726" file="f0" line="726"/>
  </Constructor>
  <Constructor id="_1539" name="v4l2_standard" artificial="1" throw="" context="_778" access="public" mangled="_ZN13v4l2_standardC1Ev *INTERNAL* " demangled="v4l2_standard::v4l2_standard()" location="f0:726" file="f0" line="726" inline="1"/>
  <Field id="_1540" name="type" type="_592" offset="0" context="_789" access="public" location="f0:1609" file="f0" line="1609"/>
  <Field id="_1541" name="parm" type="_1542" offset="32" context="_789" access="public" location="f0:1614" file="f0" line="1614"/>
  <Union id="_1542" context="_789" access="public" mangled="N15v4l2_streamparm4._14E" demangled="v4l2_streamparm::._14" location="f0:1610" file="f0" line="1610" artificial="1" size="1600" align="32" members="_1792 _1793 _1794 _1795 _1796 _1797 _1798 " bases=""/>
  <Destructor id="_1543" name="v4l2_streamparm" artificial="1" throw="" context="_789" access="public" mangled="_ZN15v4l2_streamparmD1Ev *INTERNAL* " demangled="v4l2_streamparm::~v4l2_streamparm()" location="f0:1608" file="f0" line="1608" endline="1608" inline="1">
  </Destructor>
  <OperatorMethod id="_1544" name="=" returns="_1799" artificial="1" throw="" context="_789" access="public" mangled="_ZN15v4l2_streamparmaSERKS_" demangled="v4l2_streamparm::operator=(v4l2_streamparm const&amp;)" location="f0:1608" file="f0" line="1608" endline="1608" inline="1">
    <Argument type="_1800" location="f0:1608" file="f0" line="1608"/>
  </OperatorMethod>
  <Constructor id="_1545" name="v4l2_streamparm" artificial="1" throw="" context="_789" access="public" mangled="_ZN15v4l2_streamparmC1ERKS_ *INTERNAL* " demangled="v4l2_streamparm::v4l2_streamparm(v4l2_streamparm const&amp;)" location="f0:1608" file="f0" line="1608" endline="1608" inline="1">
    <Argument type="_1800" location="f0:1608" file="f0" line="1608"/>
  </Constructor>
  <Constructor id="_1546" name="v4l2_streamparm" artificial="1" throw="" context="_789" access="public" mangled="_ZN15v4l2_streamparmC1Ev *INTERNAL* " demangled="v4l2_streamparm::v4l2_streamparm()" location="f0:1608" file="f0" line="1608" inline="1"/>
  <Field id="_1547" name="numerator" type="_612" offset="0" context="_794" access="public" location="f0:223" file="f0" line="223"/>
  <Field id="_1548" name="denominator" type="_612" offset="32" context="_794" access="public" location="f0:224" file="f0" line="224"/>
  <Destructor id="_1549" name="v4l2_fract" artificial="1" throw="" context="_794" access="public" mangled="_ZN10v4l2_fractD1Ev *INTERNAL* " demangled="v4l2_fract::~v4l2_fract()" location="f0:222" file="f0" line="222" endline="222" inline="1">
  </Destructor>
  <OperatorMethod id="_1550" name="=" returns="_1801" artificial="1" throw="" context="_794" access="public" mangled="_ZN10v4l2_fractaSERKS_" demangled="v4l2_fract::operator=(v4l2_fract const&amp;)" location="f0:222" file="f0" line="222" endline="222" inline="1">
    <Argument type="_1802" location="f0:222" file="f0" line="222"/>
  </OperatorMethod>
  <Constructor id="_1551" name="v4l2_fract" artificial="1" throw="" context="_794" access="public" mangled="_ZN10v4l2_fractC1ERKS_ *INTERNAL* " demangled="v4l2_fract::v4l2_fract(v4l2_fract const&amp;)" location="f0:222" file="f0" line="222" endline="222" inline="1">
    <Argument type="_1802" location="f0:222" file="f0" line="222"/>
  </Constructor>
  <Constructor id="_1552" name="v4l2_fract" artificial="1" throw="" context="_794" access="public" mangled="_ZN10v4l2_fractC1Ev *INTERNAL* " demangled="v4l2_fract::v4l2_fract()" location="f0:222" file="f0" line="222" inline="1"/>
  <Field id="_1553" name="sampling_rate" type="_612" offset="0" context="_796" access="public" location="f0:1477" file="f0" line="1477"/>
  <Field id="_1554" name="offset" type="_612" offset="32" context="_796" access="public" location="f0:1478" file="f0" line="1478"/>
  <Field id="_1555" name="samples_per_line" type="_612" offset="64" context="_796" access="public" location="f0:1479" file="f0" line="1479"/>
  <Field id="_1556" name="sample_format" type="_612" offset="96" context="_796" access="public" location="f0:1480" file="f0" line="1480"/>
  <Field id="_1557" name="start" type="_1803" offset="128" context="_796" access="public" location="f0:1481" file="f0" line="1481"/>
  <Field id="_1558" name="count" type="_1596" offset="192" context="_796" access="public" location="f0:1482" file="f0" line="1482"/>
  <Field id="_1559" name="flags" type="_612" offset="256" context="_796" access="public" location="f0:1483" file="f0" line="1483"/>
  <Field id="_1560" name="reserved" type="_1596" offset="288" context="_796" access="public" location="f0:1484" file="f0" line="1484"/>
  <Destructor id="_1561" name="v4l2_vbi_format" artificial="1" throw="" context="_796" access="public" mangled="_ZN15v4l2_vbi_formatD1Ev *INTERNAL* " demangled="v4l2_vbi_format::~v4l2_vbi_format()" location="f0:1476" file="f0" line="1476" endline="1476" inline="1">
  </Destructor>
  <OperatorMethod id="_1562" name="=" returns="_1804" artificial="1" throw="" context="_796" access="public" mangled="_ZN15v4l2_vbi_formataSERKS_" demangled="v4l2_vbi_format::operator=(v4l2_vbi_format const&amp;)" location="f0:1476" file="f0" line="1476" endline="1476" inline="1">
    <Argument type="_1805" location="f0:1476" file="f0" line="1476"/>
  </OperatorMethod>
  <Constructor id="_1563" name="v4l2_vbi_format" artificial="1" throw="" context="_796" access="public" mangled="_ZN15v4l2_vbi_formatC1ERKS_ *INTERNAL* " demangled="v4l2_vbi_format::v4l2_vbi_format(v4l2_vbi_format const&amp;)" location="f0:1476" file="f0" line="1476" endline="1476" inline="1">
    <Argument type="_1805" location="f0:1476" file="f0" line="1476"/>
  </Constructor>
  <Constructor id="_1564" name="v4l2_vbi_format" artificial="1" throw="" context="_796" access="public" mangled="_ZN15v4l2_vbi_formatC1Ev *INTERNAL* " demangled="v4l2_vbi_format::v4l2_vbi_format()" location="f0:1476" file="f0" line="1476" inline="1"/>
  <PointerType id="_1565" type="_567" size="64" align="64"/>
  <Field id="_1566" name="addr" type="_612" offset="0" context="_829" access="public" location="f0:1634" file="f0" line="1634"/>
  <Field id="_1567" name="name" type="_1806" offset="0" context="_829" access="public" location="f0:1635" file="f0" line="1635"/>
  <ReferenceType id="_1568" type="_3" size="64" align="64"/>
  <ReferenceType id="_1569" type="_3c" size="64" align="64"/>
  <ReferenceType id="_1571" type="_10" size="64" align="64"/>
  <ReferenceType id="_1572" type="_10c" size="64" align="64"/>
  <ArrayType id="_1573" min="0" max="31u" type="_566" size="256" align="8"/>
  <ReferenceType id="_1574" type="_14" size="64" align="64"/>
  <ReferenceType id="_1575" type="_14c" size="64" align="64"/>
  <ReferenceType id="_1576" type="_26" size="64" align="64"/>
  <ReferenceType id="_1577" type="_26c" size="64" align="64"/>
  <Field id="_1578" name="raw" type="_1579" offset="0" context="_870" access="public" location="f0:1462" file="f0" line="1462"/>
  <Struct id="_1579" context="_870" access="public" mangled="N16v4l2_encoder_cmd4._104._11E" demangled="v4l2_encoder_cmd::._10::._11" location="f0:1460" file="f0" line="1460" artificial="1" size="256" align="32" members="_1810 _1811 _1812 _1813 _1814 " bases=""/>
  <ReferenceType id="_1580" type="_30" size="64" align="64"/>
  <ReferenceType id="_1581" type="_30c" size="64" align="64"/>
  <PointerType id="_1583" type="_810" size="64" align="64"/>
  <PointerType id="_1584" type="_822" size="64" align="64"/>
  <PointerType id="_1585" type="_581" size="64" align="64"/>
  <PointerType id="_1586" type="_171" size="64" align="64"/>
  <ReferenceType id="_1587" type="_54" size="64" align="64"/>
  <ReferenceType id="_1588" type="_54c" size="64" align="64"/>
  <ArrayType id="_1589" min="0" max="15u" type="_15" size="1024" align="64"/>
  <ReferenceType id="_1590" type="_68" size="64" align="64"/>
  <ReferenceType id="_1591" type="_68c" size="64" align="64"/>
  <ArrayType id="_1592" min="0" max="1u" type="_1817" size="768" align="16"/>
  <ArrayType id="_1593" min="0" max="2u" type="_612" size="96" align="32"/>
  <ReferenceType id="_1594" type="_74" size="64" align="64"/>
  <ReferenceType id="_1595" type="_74c" size="64" align="64"/>
  <ArrayType id="_1596" min="0" max="1u" type="_612" size="64" align="32"/>
  <Field id="_1597" name="discrete" type="_794" offset="0" context="_915" access="public" location="f0:443" file="f0" line="443"/>
  <Field id="_1598" name="stepwise" type="_642" offset="0" context="_915" access="public" location="f0:444" file="f0" line="444"/>
  <ReferenceType id="_1599" type="_110" size="64" align="64"/>
  <ReferenceType id="_1600" type="_110c" size="64" align="64"/>
  <PointerType id="_1601" type="_514" size="64" align="64"/>
  <ArrayType id="_1602" min="0" max="0u" type="_1294" size="8" align="8"/>
  <PointerType id="_1603" type="_81" size="64" align="64"/>
  <ArrayType id="_1604" min="0" max="19u" type="_1294" size="160" align="8"/>
  <ReferenceType id="_1605" type="_117" size="64" align="64"/>
  <ReferenceType id="_1606" type="_117c" size="64" align="64"/>
  <ReferenceType id="_1607" type="_154" size="64" align="64"/>
  <ReferenceType id="_1608" type="_154c" size="64" align="64"/>
  <ArrayType id="_1609" min="0" max="7u" type="_612" size="256" align="32"/>
  <ReferenceType id="_1610" type="_155" size="64" align="64"/>
  <ReferenceType id="_1611" type="_155c" size="64" align="64"/>
  <ArrayType id="_1614" min="0" max="15u" type="_644" size="1024" align="64"/>
  <ReferenceType id="_1615" type="_198" size="64" align="64"/>
  <ReferenceType id="_1616" type="_198c" size="64" align="64"/>
  <ReferenceType id="_1618" type="_228" size="64" align="64"/>
  <ReferenceType id="_1619" type="_228c" size="64" align="64"/>
  <ReferenceType id="_1620" type="_240" size="64" align="64"/>
  <ReferenceType id="_1621" type="_240c" size="64" align="64"/>
  <PointerType id="_1622" type="_546" size="64" align="64"/>
  <PointerType id="_1623" type="_598" size="64" align="64"/>
  <PointerType id="_1624" type="_666" size="64" align="64"/>
  <ReferenceType id="_1625" type="_243" size="64" align="64"/>
  <ReferenceType id="_1626" type="_243c" size="64" align="64"/>
  <ReferenceType id="_1627" type="_244" size="64" align="64"/>
  <ReferenceType id="_1628" type="_244c" size="64" align="64"/>
  <ReferenceType id="_1629" type="_245" size="64" align="64"/>
  <ReferenceType id="_1630" type="_245c" size="64" align="64"/>
  <ReferenceType id="_1631" type="_249" size="64" align="64"/>
  <ReferenceType id="_1632" type="_249c" size="64" align="64"/>
  <PointerType id="_1633" type="_252" size="64" align="64"/>
  <ReferenceType id="_1634" type="_252" size="64" align="64"/>
  <ReferenceType id="_1635" type="_252c" size="64" align="64"/>
  <ReferenceType id="_1636" type="_282" size="64" align="64"/>
  <ReferenceType id="_1637" type="_282c" size="64" align="64"/>
  <Field id="_1638" name="offset" type="_612" offset="0" context="_1081" access="public" location="f0:531" file="f0" line="531"/>
  <Field id="_1639" name="userptr" type="_15" offset="0" context="_1081" access="public" location="f0:532" file="f0" line="532"/>
  <Destructor id="_1640" name="._7" artificial="1" throw="" context="_1081" access="public" mangled="_ZN11v4l2_buffer3._7D1Ev *INTERNAL* " demangled="v4l2_buffer::._7::~._7()" location="f0:530" file="f0" line="530" endline="530" inline="1">
  </Destructor>
  <OperatorMethod id="_1641" name="=" returns="_1832" artificial="1" throw="" context="_1081" access="public" mangled="_ZN11v4l2_buffer3._7aSERKS0_" demangled="v4l2_buffer::._7::operator=(v4l2_buffer::._7 const&amp;)" location="f0:530" file="f0" line="530" endline="530" inline="1">
    <Argument type="_1833" location="f0:530" file="f0" line="530"/>
  </OperatorMethod>
  <Constructor id="_1642" artificial="1" throw="" context="_1081" access="public" mangled="_ZN11v4l2_buffer3._7C1ERKS0_ *INTERNAL* " demangled="v4l2_buffer::._7::._7(v4l2_buffer::._7 const&amp;)" location="f0:530" file="f0" line="530" endline="530" inline="1">
    <Argument type="_1833" location="f0:530" file="f0" line="530"/>
  </Constructor>
  <Constructor id="_1643" artificial="1" throw="" context="_1081" access="public" mangled="_ZN11v4l2_buffer3._7C1Ev *INTERNAL* " demangled="v4l2_buffer::._7::._7()" location="f0:530" file="f0" line="530" inline="1"/>
  <ReferenceType id="_1644" type="_297" size="64" align="64"/>
  <ReferenceType id="_1645" type="_297c" size="64" align="64"/>
  <ArrayType id="_1646" min="0" max="35u" type="_650" size="12384" align="8"/>
  <ReferenceType id="_1647" type="_302" size="64" align="64"/>
  <ReferenceType id="_1648" type="_302c" size="64" align="64"/>
  <Field id="_1649" name="pix" type="_282" offset="0" context="_1095" access="public" location="f0:1597" file="f0" line="1597"/>
  <Field id="_1650" name="win" type="_504" offset="0" context="_1095" access="public" location="f0:1598" file="f0" line="1598"/>
  <Field id="_1651" name="vbi" type="_796" offset="0" context="_1095" access="public" location="f0:1599" file="f0" line="1599"/>
  <Field id="_1652" name="sliced" type="_610" offset="0" context="_1095" access="public" location="f0:1600" file="f0" line="1600"/>
  <Field id="_1653" name="raw_data" type="_1836" offset="0" context="_1095" access="public" location="f0:1601" file="f0" line="1601"/>
  <Destructor id="_1654" name="._13" artificial="1" throw="" context="_1095" access="public" mangled="_ZN11v4l2_format4._13D1Ev *INTERNAL* " demangled="v4l2_format::._13::~._13()" location="f0:1596" file="f0" line="1596" endline="1596" inline="1">
  </Destructor>
  <OperatorMethod id="_1655" name="=" returns="_1837" artificial="1" throw="" context="_1095" access="public" mangled="_ZN11v4l2_format4._13aSERKS0_" demangled="v4l2_format::._13::operator=(v4l2_format::._13 const&amp;)" location="f0:1596" file="f0" line="1596" endline="1596" inline="1">
    <Argument type="_1838" location="f0:1596" file="f0" line="1596"/>
  </OperatorMethod>
  <Constructor id="_1656" artificial="1" throw="" context="_1095" access="public" mangled="_ZN11v4l2_format4._13C1ERKS0_ *INTERNAL* " demangled="v4l2_format::._13::._13(v4l2_format::._13 const&amp;)" location="f0:1596" file="f0" line="1596" endline="1596" inline="1">
    <Argument type="_1838" location="f0:1596" file="f0" line="1596"/>
  </Constructor>
  <Constructor id="_1657" artificial="1" throw="" context="_1095" access="public" mangled="_ZN11v4l2_format4._13C1Ev *INTERNAL* " demangled="v4l2_format::._13::._13()" location="f0:1596" file="f0" line="1596" inline="1"/>
  <ReferenceType id="_1658" type="_307" size="64" align="64"/>
  <ReferenceType id="_1659" type="_307c" size="64" align="64"/>
  <ReferenceType id="_1660" type="_311" size="64" align="64"/>
  <ReferenceType id="_1661" type="_311c" size="64" align="64"/>
  <ArrayType id="_1662" min="0" max="15u" type="_566" size="128" align="8"/>
  <ArrayType id="_1663" min="0" max="3u" type="_612" size="128" align="32"/>
  <ReferenceType id="_1664" type="_316" size="64" align="64"/>
  <ReferenceType id="_1665" type="_316c" size="64" align="64"/>
  <Field id="_1666" name="bt" type="_359" offset="0" context="_1118" access="public" location="f0:820" file="f0" line="820"/>
  <Field id="_1667" name="reserved" type="_1842" offset="0" context="_1118" access="public" location="f0:821" file="f0" line="821"/>
  <ReferenceType id="_1668" type="_326" size="64" align="64"/>
  <ReferenceType id="_1669" type="_326c" size="64" align="64"/>
  <ReferenceType id="_1670" type="_336" size="64" align="64"/>
  <ReferenceType id="_1671" type="_336c" size="64" align="64"/>
  <ReferenceType id="_1672" type="_347" size="64" align="64"/>
  <ReferenceType id="_1673" type="_347c" size="64" align="64"/>
  <ReferenceType id="_1674" type="_349" size="64" align="64"/>
  <ReferenceType id="_1675" type="_349c" size="64" align="64"/>
  <ReferenceType id="_1676" type="_353" size="64" align="64"/>
  <ReferenceType id="_1677" type="_353c" size="64" align="64"/>
  <ReferenceType id="_1678" type="_356" size="64" align="64"/>
  <ReferenceType id="_1679" type="_356c" size="64" align="64"/>
  <ArrayType id="_1680" min="0" max="15u" type="_612" size="512" align="32"/>
  <ReferenceType id="_1681" type="_359" size="64" align="64"/>
  <ReferenceType id="_1682" type="_359c" size="64" align="64"/>
  <ReferenceType id="_1684" type="_365" size="64" align="64"/>
  <ReferenceType id="_1685" type="_365c" size="64" align="64"/>
  <ReferenceType id="_1686" type="_377" size="64" align="64"/>
  <ReferenceType id="_1687" type="_377c" size="64" align="64"/>
  <ReferenceType id="_1688" type="_379" size="64" align="64"/>
  <ReferenceType id="_1689" type="_379c" size="64" align="64"/>
  <ReferenceType id="_1690" type="_382" size="64" align="64"/>
  <ReferenceType id="_1691" type="_382c" size="64" align="64"/>
  <PointerType id="_1692" type="_469" size="64" align="64"/>
  <ReferenceType id="_1693" type="_384" size="64" align="64"/>
  <ReferenceType id="_1694" type="_384c" size="64" align="64"/>
  <Field id="_1695" name="__wch" type="_88" offset="0" context="_1226" access="public" location="f21:89" file="f21" line="89"/>
  <Field id="_1696" name="__wchb" type="_1854" offset="0" context="_1226" access="public" location="f21:93" file="f21" line="93"/>
  <Destructor id="_1697" name="._17" artificial="1" throw="" context="_1226" access="public" mangled="_ZN11__mbstate_t4._17D1Ev *INTERNAL* " demangled="__mbstate_t::._17::~._17()" location="f21:87" file="f21" line="87" endline="87" inline="1">
  </Destructor>
  <OperatorMethod id="_1698" name="=" returns="_1855" artificial="1" throw="" context="_1226" access="public" mangled="_ZN11__mbstate_t4._17aSERKS0_" demangled="__mbstate_t::._17::operator=(__mbstate_t::._17 const&amp;)" location="f21:87" file="f21" line="87" endline="87" inline="1">
    <Argument type="_1856" location="f21:87" file="f21" line="87"/>
  </OperatorMethod>
  <Constructor id="_1699" artificial="1" throw="" context="_1226" access="public" mangled="_ZN11__mbstate_t4._17C1ERKS0_ *INTERNAL* " demangled="__mbstate_t::._17::._17(__mbstate_t::._17 const&amp;)" location="f21:87" file="f21" line="87" endline="87" inline="1">
    <Argument type="_1856" location="f21:87" file="f21" line="87"/>
  </Constructor>
  <Constructor id="_1700" artificial="1" throw="" context="_1226" access="public" mangled="_ZN11__mbstate_t4._17C1Ev *INTERNAL* " demangled="__mbstate_t::._17::._17()" location="f21:87" file="f21" line="87" inline="1"/>
  <ReferenceType id="_1701" type="_389" size="64" align="64"/>
  <ReferenceType id="_1702" type="_389c" size="64" align="64"/>
  <ReferenceType id="_1703" type="_401" size="64" align="64"/>
  <ReferenceType id="_1704" type="_401c" size="64" align="64"/>
  <FundamentalType id="_1294" name="char" size="8" align="8"/>
  <ReferenceType id="_1708" type="_427" size="64" align="64"/>
  <ReferenceType id="_1709" type="_427c" size="64" align="64"/>
  <ReferenceType id="_1710" type="_431" size="64" align="64"/>
  <ReferenceType id="_1711" type="_431c" size="64" align="64"/>
  <ReferenceType id="_1712" type="_435" size="64" align="64"/>
  <ReferenceType id="_1713" type="_435c" size="64" align="64"/>
  <ArrayType id="_1714" min="0" max="0u" type="_612" size="32" align="32"/>
  <Field id="_1715" name="value" type="_195" offset="0" context="_1278" access="public" location="f0:912" file="f0" line="912"/>
  <Field id="_1716" name="value64" type="_210" offset="0" context="_1278" access="public" location="f0:913" file="f0" line="913"/>
  <Field id="_1717" name="string" type="_490" offset="0" context="_1278" access="public" location="f0:914" file="f0" line="914"/>
  <ReferenceType id="_1718" type="_469" size="64" align="64"/>
  <ReferenceType id="_1719" type="_469c" size="64" align="64"/>
  <ReferenceType id="_1721" type="_476" size="64" align="64"/>
  <ReferenceType id="_1722" type="_476c" size="64" align="64"/>
  <ReferenceType id="_1723" type="_499" size="64" align="64"/>
  <ReferenceType id="_1724" type="_499c" size="64" align="64"/>
  <ReferenceType id="_1725" type="_501" size="64" align="64"/>
  <ReferenceType id="_1726" type="_501c" size="64" align="64"/>
  <ArrayType id="_1727" min="0" max="1u" type="_45" size="64" align="32"/>
  <ReferenceType id="_1728" type="_502" size="64" align="64"/>
  <ReferenceType id="_1729" type="_502c" size="64" align="64"/>
  <ReferenceType id="_1730" type="_503" size="64" align="64"/>
  <ReferenceType id="_1731" type="_503c" size="64" align="64"/>
  <ReferenceType id="_1732" type="_504" size="64" align="64"/>
  <ReferenceType id="_1733" type="_504c" size="64" align="64"/>
  <ReferenceType id="_1734" type="_507" size="64" align="64"/>
  <ReferenceType id="_1735" type="_507c" size="64" align="64"/>
  <ReferenceType id="_1736" type="_514" size="64" align="64"/>
  <ReferenceType id="_1737" type="_514c" size="64" align="64"/>
  <ArrayType id="_1738" min="0" max="59u" type="_1294" size="480" align="8"/>
  <ReferenceType id="_1739" type="_535" size="64" align="64"/>
  <ReferenceType id="_1740" type="_535c" size="64" align="64"/>
  <ArrayType id="_1741" min="0" max="1u" type="_251" size="64" align="32"/>
  <ArrayType id="_1742" min="0" max="34u" type="_650" size="12040" align="8"/>
  <ReferenceType id="_1743" type="_554" size="64" align="64"/>
  <ReferenceType id="_1744" type="_554c" size="64" align="64"/>
  <ReferenceType id="_1745" type="_561" size="64" align="64"/>
  <ReferenceType id="_1746" type="_561c" size="64" align="64"/>
  <ReferenceType id="_1747" type="_582" size="64" align="64"/>
  <ReferenceType id="_1748" type="_582c" size="64" align="64"/>
  <ReferenceType id="_1749" type="_606" size="64" align="64"/>
  <ReferenceType id="_1750" type="_606c" size="64" align="64"/>
  <ReferenceType id="_1751" type="_610" size="64" align="64"/>
  <ReferenceType id="_1752" type="_610c" size="64" align="64"/>
  <ReferenceType id="_1753" type="_618" size="64" align="64"/>
  <ReferenceType id="_1754" type="_618c" size="64" align="64"/>
  <ReferenceType id="_1755" type="_642" size="64" align="64"/>
  <ReferenceType id="_1756" type="_642c" size="64" align="64"/>
  <ArrayType id="_1757" min="0" max="41u" type="_566" size="336" align="8"/>
  <ReferenceType id="_1758" type="_650" size="64" align="64"/>
  <ReferenceType id="_1759" type="_650c" size="64" align="64"/>
  <ReferenceType id="_1760" type="_676" size="64" align="64"/>
  <ReferenceType id="_1761" type="_676c" size="64" align="64"/>
  <ReferenceType id="_1762" type="_677" size="64" align="64"/>
  <ReferenceType id="_1763" type="_677c" size="64" align="64"/>
  <ReferenceType id="_1764" type="_682" size="64" align="64"/>
  <ReferenceType id="_1765" type="_682c" size="64" align="64"/>
  <ArrayType id="_1766" min="0" max="47u" type="_566" size="384" align="8"/>
  <ReferenceType id="_1767" type="_694" size="64" align="64"/>
  <ReferenceType id="_1768" type="_694c" size="64" align="64"/>
  <Field id="_1769" name="discrete" type="_677" offset="0" context="_1470" access="public" location="f0:413" file="f0" line="413"/>
  <Field id="_1770" name="stepwise" type="_356" offset="0" context="_1470" access="public" location="f0:414" file="f0" line="414"/>
  <ReferenceType id="_1771" type="_701" size="64" align="64"/>
  <ReferenceType id="_1772" type="_701c" size="64" align="64"/>
  <ArrayType id="_1773" min="0" max="3u" type="_566" size="32" align="8"/>
  <Field id="_1774" name="itv0" type="_554" offset="0" context="_1477" access="public" location="f0:1583" file="f0" line="1583"/>
  <Field id="_1775" name="ITV0" type="_302" offset="0" context="_1477" access="public" location="f0:1584" file="f0" line="1584"/>
  <ReferenceType id="_1776" type="_714" size="64" align="64"/>
  <ReferenceType id="_1777" type="_714c" size="64" align="64"/>
  <ReferenceType id="_1778" type="_716" size="64" align="64"/>
  <ReferenceType id="_1779" type="_716c" size="64" align="64"/>
  <ReferenceType id="_1780" type="_751" size="64" align="64"/>
  <ReferenceType id="_1781" type="_751c" size="64" align="64"/>
  <ArrayType id="_1782" min="0" max="63u" type="_769" size="16384" align="64"/>
  <ReferenceType id="_1783" type="_760" size="64" align="64"/>
  <ReferenceType id="_1784" type="_760c" size="64" align="64"/>
  <ReferenceType id="_1785" type="_761" size="64" align="64"/>
  <ReferenceType id="_1786" type="_761c" size="64" align="64"/>
  <ReferenceType id="_1787" type="_769" size="64" align="64"/>
  <ReferenceType id="_1788" type="_769c" size="64" align="64"/>
  <ArrayType id="_1789" min="0" max="23u" type="_566" size="192" align="8"/>
  <ReferenceType id="_1790" type="_778" size="64" align="64"/>
  <ReferenceType id="_1791" type="_778c" size="64" align="64"/>
  <Field id="_1792" name="capture" type="_476" offset="0" context="_1542" access="public" location="f0:1611" file="f0" line="1611"/>
  <Field id="_1793" name="output" type="_761" offset="0" context="_1542" access="public" location="f0:1612" file="f0" line="1612"/>
  <Field id="_1794" name="raw_data" type="_1836" offset="0" context="_1542" access="public" location="f0:1613" file="f0" line="1613"/>
  <Destructor id="_1795" name="._14" artificial="1" throw="" context="_1542" access="public" mangled="_ZN15v4l2_streamparm4._14D1Ev *INTERNAL* " demangled="v4l2_streamparm::._14::~._14()" location="f0:1610" file="f0" line="1610" endline="1610" inline="1">
  </Destructor>
  <OperatorMethod id="_1796" name="=" returns="_1890" artificial="1" throw="" context="_1542" access="public" mangled="_ZN15v4l2_streamparm4._14aSERKS0_" demangled="v4l2_streamparm::._14::operator=(v4l2_streamparm::._14 const&amp;)" location="f0:1610" file="f0" line="1610" endline="1610" inline="1">
    <Argument type="_1891" location="f0:1610" file="f0" line="1610"/>
  </OperatorMethod>
  <Constructor id="_1797" artificial="1" throw="" context="_1542" access="public" mangled="_ZN15v4l2_streamparm4._14C1ERKS0_ *INTERNAL* " demangled="v4l2_streamparm::._14::._14(v4l2_streamparm::._14 const&amp;)" location="f0:1610" file="f0" line="1610" endline="1610" inline="1">
    <Argument type="_1891" location="f0:1610" file="f0" line="1610"/>
  </Constructor>
  <Constructor id="_1798" artificial="1" throw="" context="_1542" access="public" mangled="_ZN15v4l2_streamparm4._14C1Ev *INTERNAL* " demangled="v4l2_streamparm::._14::._14()" location="f0:1610" file="f0" line="1610" inline="1"/>
  <ReferenceType id="_1799" type="_789" size="64" align="64"/>
  <ReferenceType id="_1800" type="_789c" size="64" align="64"/>
  <ReferenceType id="_1801" type="_794" size="64" align="64"/>
  <ReferenceType id="_1802" type="_794c" size="64" align="64"/>
  <ArrayType id="_1803" min="0" max="1u" type="_195" size="64" align="32"/>
  <ReferenceType id="_1804" type="_796" size="64" align="64"/>
  <ReferenceType id="_1805" type="_796c" size="64" align="64"/>
  <ArrayType id="_1806" min="0" max="31u" type="_1294" size="256" align="8"/>
  <Field id="_1810" name="data" type="_1609" offset="0" context="_1579" access="public" location="f0:1461" file="f0" line="1461"/>
  <Destructor id="_1811" name="._11" artificial="1" throw="" context="_1579" access="public" mangled="_ZN16v4l2_encoder_cmd4._104._11D1Ev *INTERNAL* " demangled="v4l2_encoder_cmd::._10::._11::~._11()" location="f0:1460" file="f0" line="1460" endline="1460" inline="1">
  </Destructor>
  <OperatorMethod id="_1812" name="=" returns="_1895" artificial="1" throw="" context="_1579" access="public" mangled="_ZN16v4l2_encoder_cmd4._104._11aSERKS1_" demangled="v4l2_encoder_cmd::._10::._11::operator=(v4l2_encoder_cmd::._10::._11 const&amp;)" location="f0:1460" file="f0" line="1460" endline="1460" inline="1">
    <Argument type="_1896" location="f0:1460" file="f0" line="1460"/>
  </OperatorMethod>
  <Constructor id="_1813" artificial="1" throw="" context="_1579" access="public" mangled="_ZN16v4l2_encoder_cmd4._104._11C1ERKS1_ *INTERNAL* " demangled="v4l2_encoder_cmd::._10::._11::._11(v4l2_encoder_cmd::._10::._11 const&amp;)" location="f0:1460" file="f0" line="1460" endline="1460" inline="1">
    <Argument type="_1896" location="f0:1460" file="f0" line="1460"/>
  </Constructor>
  <Constructor id="_1814" artificial="1" throw="" context="_1579" access="public" mangled="_ZN16v4l2_encoder_cmd4._104._11C1Ev *INTERNAL* " demangled="v4l2_encoder_cmd::._10::._11::._11()" location="f0:1460" file="f0" line="1460" inline="1"/>
  <ArrayType id="_1817" min="0" max="23u" type="_609" size="384" align="16"/>
  <ReferenceType id="_1832" type="_1081" size="64" align="64"/>
  <ReferenceType id="_1833" type="_1081c" size="64" align="64"/>
  <ArrayType id="_1836" min="0" max="199u" type="_566" size="1600" align="8"/>
  <ReferenceType id="_1837" type="_1095" size="64" align="64"/>
  <ReferenceType id="_1838" type="_1095c" size="64" align="64"/>
  <ArrayType id="_1842" min="0" max="31u" type="_612" size="1024" align="32"/>
  <ArrayType id="_1854" min="0" max="3u" type="_1294" size="32" align="8"/>
  <ReferenceType id="_1855" type="_1226" size="64" align="64"/>
  <ReferenceType id="_1856" type="_1226c" size="64" align="64"/>
  <ReferenceType id="_1890" type="_1542" size="64" align="64"/>
  <ReferenceType id="_1891" type="_1542c" size="64" align="64"/>
  <ReferenceType id="_1895" type="_1579" size="64" align="64"/>
  <ReferenceType id="_1896" type="_1579c" size="64" align="64"/>
  <CvQualifiedType id="_1294c" type="_1294" const="1"/>
  <FunctionType id="_955" returns="_80">
    <Argument type="_45"/>
  </FunctionType>
  <CvQualifiedType id="_80c" type="_80" const="1"/>
  <CvQualifiedType id="_502c" type="_502" const="1"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <CvQualifiedType id="_68c" type="_68" const="1"/>
  <CvQualifiedType id="_379c" type="_379" const="1"/>
  <CvQualifiedType id="_198c" type="_198" const="1"/>
  <CvQualifiedType id="_582c" type="_582" const="1"/>
  <CvQualifiedType id="_618c" type="_618" const="1"/>
  <CvQualifiedType id="_347c" type="_347" const="1"/>
  <CvQualifiedType id="_503c" type="_503" const="1"/>
  <CvQualifiedType id="_26c" type="_26" const="1"/>
  <CvQualifiedType id="_794c" type="_794" const="1"/>
  <CvQualifiedType id="_316c" type="_316" const="1"/>
  <CvQualifiedType id="_282c" type="_282" const="1"/>
  <CvQualifiedType id="_676c" type="_676" const="1"/>
  <CvQualifiedType id="_677c" type="_677" const="1"/>
  <CvQualifiedType id="_356c" type="_356" const="1"/>
  <CvQualifiedType id="_701c" type="_701" const="1"/>
  <CvQualifiedType id="_642c" type="_642" const="1"/>
  <CvQualifiedType id="_110c" type="_110" const="1"/>
  <CvQualifiedType id="_751c" type="_751" const="1"/>
  <CvQualifiedType id="_535c" type="_535" const="1"/>
  <CvQualifiedType id="_716c" type="_716" const="1"/>
  <CvQualifiedType id="_1081c" type="_1081" const="1"/>
  <CvQualifiedType id="_297c" type="_297" const="1"/>
  <CvQualifiedType id="_561c" type="_561" const="1"/>
